Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x674 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x5103): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -ffast-math -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x405f): ../Components/lsm303agr/lsm303agr.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x3887): C:/Users/worbb/Desktop/Electronics/SEMP/sempspace/p2_vibrationsensor_FreeRTOS/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 5 (DW_TAG_typedef)
    <2b>   DW_AT_name        : (indirect string, offset: 0x3d54): __int8_t
    <2f>   DW_AT_decl_file   : 2
    <30>   DW_AT_decl_line   : 41
    <31>   DW_AT_decl_column : 23
    <32>   DW_AT_type        : <0x36>
 <1><36>: Abbrev Number: 6 (DW_TAG_base_type)
    <37>   DW_AT_byte_size   : 1
    <38>   DW_AT_encoding    : 6	(signed char)
    <39>   DW_AT_name        : (indirect string, offset: 0x379a): signed char
 <1><3d>: Abbrev Number: 5 (DW_TAG_typedef)
    <3e>   DW_AT_name        : (indirect string, offset: 0xb00): __uint8_t
    <42>   DW_AT_decl_file   : 2
    <43>   DW_AT_decl_line   : 43
    <44>   DW_AT_decl_column : 24
    <45>   DW_AT_type        : <0x49>
 <1><49>: Abbrev Number: 6 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1
    <4b>   DW_AT_encoding    : 8	(unsigned char)
    <4c>   DW_AT_name        : (indirect string, offset: 0x3587): unsigned char
 <1><50>: Abbrev Number: 5 (DW_TAG_typedef)
    <51>   DW_AT_name        : (indirect string, offset: 0x4314): __int16_t
    <55>   DW_AT_decl_file   : 2
    <56>   DW_AT_decl_line   : 55
    <57>   DW_AT_decl_column : 24
    <58>   DW_AT_type        : <0x5c>
 <1><5c>: Abbrev Number: 6 (DW_TAG_base_type)
    <5d>   DW_AT_byte_size   : 2
    <5e>   DW_AT_encoding    : 5	(signed)
    <5f>   DW_AT_name        : (indirect string, offset: 0x54e): short int
 <1><63>: Abbrev Number: 5 (DW_TAG_typedef)
    <64>   DW_AT_name        : (indirect string, offset: 0x1930): __uint16_t
    <68>   DW_AT_decl_file   : 2
    <69>   DW_AT_decl_line   : 57
    <6a>   DW_AT_decl_column : 25
    <6b>   DW_AT_type        : <0x6f>
 <1><6f>: Abbrev Number: 6 (DW_TAG_base_type)
    <70>   DW_AT_byte_size   : 2
    <71>   DW_AT_encoding    : 7	(unsigned)
    <72>   DW_AT_name        : (indirect string, offset: 0x4018): short unsigned int
 <1><76>: Abbrev Number: 6 (DW_TAG_base_type)
    <77>   DW_AT_byte_size   : 4
    <78>   DW_AT_encoding    : 5	(signed)
    <79>   DW_AT_name        : (indirect string, offset: 0x4255): long int
 <1><7d>: Abbrev Number: 6 (DW_TAG_base_type)
    <7e>   DW_AT_byte_size   : 4
    <7f>   DW_AT_encoding    : 7	(unsigned)
    <80>   DW_AT_name        : (indirect string, offset: 0x104e): long unsigned int
 <1><84>: Abbrev Number: 6 (DW_TAG_base_type)
    <85>   DW_AT_byte_size   : 8
    <86>   DW_AT_encoding    : 5	(signed)
    <87>   DW_AT_name        : (indirect string, offset: 0x2dc6): long long int
 <1><8b>: Abbrev Number: 6 (DW_TAG_base_type)
    <8c>   DW_AT_byte_size   : 8
    <8d>   DW_AT_encoding    : 7	(unsigned)
    <8e>   DW_AT_name        : (indirect string, offset: 0x4835): long long unsigned int
 <1><92>: Abbrev Number: 18 (DW_TAG_base_type)
    <93>   DW_AT_byte_size   : 4
    <94>   DW_AT_encoding    : 5	(signed)
    <95>   DW_AT_name        : int
 <1><99>: Abbrev Number: 6 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x1474): unsigned int
 <1><a0>: Abbrev Number: 5 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x3d56): int8_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 20
    <a7>   DW_AT_decl_column : 18
    <a8>   DW_AT_type        : <0x2a>
 <1><ac>: Abbrev Number: 5 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0xb02): uint8_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 24
    <b3>   DW_AT_decl_column : 19
    <b4>   DW_AT_type        : <0x3d>
 <1><b8>: Abbrev Number: 5 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0x4316): int16_t
    <bd>   DW_AT_decl_file   : 3
    <be>   DW_AT_decl_line   : 32
    <bf>   DW_AT_decl_column : 19
    <c0>   DW_AT_type        : <0x50>
 <1><c4>: Abbrev Number: 5 (DW_TAG_typedef)
    <c5>   DW_AT_name        : (indirect string, offset: 0x6af94): uint16_t
    <c9>   DW_AT_decl_file   : 3
    <ca>   DW_AT_decl_line   : 36
    <cb>   DW_AT_decl_column : 20
    <cc>   DW_AT_type        : <0x63>
 <1><d0>: Abbrev Number: 19 (DW_TAG_structure_type)
    <d1>   DW_AT_byte_size   : 52
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 68
    <d4>   DW_AT_decl_column : 9
    <d5>   DW_AT_sibling     : <0x169>
 <2><d9>: Abbrev Number: 2 (DW_TAG_member)
    <da>   DW_AT_name        : (indirect string, offset: 0x9564e): Init
    <de>   DW_AT_decl_file   : 4
    <de>   DW_AT_decl_line   : 70
    <df>   DW_AT_decl_column : 15
    <df>   DW_AT_type        : <0x174>
    <e3>   DW_AT_data_member_location: 0
 <2><e4>: Abbrev Number: 2 (DW_TAG_member)
    <e5>   DW_AT_name        : (indirect string, offset: 0x9b3f9): DeInit
    <e9>   DW_AT_decl_file   : 4
    <e9>   DW_AT_decl_line   : 71
    <ea>   DW_AT_decl_column : 15
    <ea>   DW_AT_type        : <0x17a>
    <ee>   DW_AT_data_member_location: 4
 <2><ef>: Abbrev Number: 2 (DW_TAG_member)
    <f0>   DW_AT_name        : (indirect string, offset: 0x6227): ReadID
    <f4>   DW_AT_decl_file   : 4
    <f4>   DW_AT_decl_line   : 72
    <f5>   DW_AT_decl_column : 15
    <f5>   DW_AT_type        : <0x184>
    <f9>   DW_AT_data_member_location: 8
 <2><fa>: Abbrev Number: 2 (DW_TAG_member)
    <fb>   DW_AT_name        : (indirect string, offset: 0xa2ce2): Reset
    <ff>   DW_AT_decl_file   : 4
    <ff>   DW_AT_decl_line   : 73
    <100>   DW_AT_decl_column : 15
    <100>   DW_AT_type        : <0x17a>
    <104>   DW_AT_data_member_location: 12
 <2><105>: Abbrev Number: 2 (DW_TAG_member)
    <106>   DW_AT_name        : (indirect string, offset: 0): LowPower
    <10a>   DW_AT_decl_file   : 4
    <10a>   DW_AT_decl_line   : 74
    <10b>   DW_AT_decl_column : 15
    <10b>   DW_AT_type        : <0x17a>
    <10f>   DW_AT_data_member_location: 16
 <2><110>: Abbrev Number: 2 (DW_TAG_member)
    <111>   DW_AT_name        : (indirect string, offset: 0x4aa7): ConfigIT
    <115>   DW_AT_decl_file   : 4
    <115>   DW_AT_decl_line   : 75
    <116>   DW_AT_decl_column : 15
    <116>   DW_AT_type        : <0x17a>
    <11a>   DW_AT_data_member_location: 20
 <2><11b>: Abbrev Number: 2 (DW_TAG_member)
    <11c>   DW_AT_name        : (indirect string, offset: 0x2b58): EnableIT
    <120>   DW_AT_decl_file   : 4
    <120>   DW_AT_decl_line   : 76
    <121>   DW_AT_decl_column : 15
    <121>   DW_AT_type        : <0x194>
    <125>   DW_AT_data_member_location: 24
 <2><126>: Abbrev Number: 2 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0x1acd): DisableIT
    <12b>   DW_AT_decl_file   : 4
    <12b>   DW_AT_decl_line   : 77
    <12c>   DW_AT_decl_column : 15
    <12c>   DW_AT_type        : <0x194>
    <130>   DW_AT_data_member_location: 28
 <2><131>: Abbrev Number: 2 (DW_TAG_member)
    <132>   DW_AT_name        : (indirect string, offset: 0x39f2): ITStatus
    <136>   DW_AT_decl_file   : 4
    <136>   DW_AT_decl_line   : 78
    <137>   DW_AT_decl_column : 15
    <137>   DW_AT_type        : <0x1a8>
    <13b>   DW_AT_data_member_location: 32
 <2><13c>: Abbrev Number: 2 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0x3b1d): ClearIT
    <141>   DW_AT_decl_file   : 4
    <141>   DW_AT_decl_line   : 79
    <142>   DW_AT_decl_column : 15
    <142>   DW_AT_type        : <0x17a>
    <146>   DW_AT_data_member_location: 36
 <2><147>: Abbrev Number: 2 (DW_TAG_member)
    <148>   DW_AT_name        : (indirect string, offset: 0x5d91): FilterConfig
    <14c>   DW_AT_decl_file   : 4
    <14c>   DW_AT_decl_line   : 80
    <14d>   DW_AT_decl_column : 15
    <14d>   DW_AT_type        : <0x194>
    <151>   DW_AT_data_member_location: 40
 <2><152>: Abbrev Number: 2 (DW_TAG_member)
    <153>   DW_AT_name        : (indirect string, offset: 0x6474): FilterCmd
    <157>   DW_AT_decl_file   : 4
    <157>   DW_AT_decl_line   : 81
    <158>   DW_AT_decl_column : 15
    <158>   DW_AT_type        : <0x194>
    <15c>   DW_AT_data_member_location: 44
 <2><15d>: Abbrev Number: 2 (DW_TAG_member)
    <15e>   DW_AT_name        : (indirect string, offset: 0x98c6b): GetXYZ
    <162>   DW_AT_decl_file   : 4
    <162>   DW_AT_decl_line   : 82
    <163>   DW_AT_decl_column : 15
    <163>   DW_AT_type        : <0x1bd>
    <167>   DW_AT_data_member_location: 48
 <2><168>: Abbrev Number: 0
 <1><169>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <16a>   DW_AT_prototyped  : 1
    <16a>   DW_AT_sibling     : <0x174>
 <2><16e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <16f>   DW_AT_type        : <0xc4>
 <2><173>: Abbrev Number: 0
 <1><174>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <175>   DW_AT_byte_size   : 4
    <175>   DW_AT_type        : <0x169>
 <1><179>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <17a>   DW_AT_prototyped  : 1
 <1><17a>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <17b>   DW_AT_byte_size   : 4
    <17b>   DW_AT_type        : <0x179>
 <1><17f>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <180>   DW_AT_prototyped  : 1
    <180>   DW_AT_type        : <0xac>
 <1><184>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <185>   DW_AT_byte_size   : 4
    <185>   DW_AT_type        : <0x17f>
 <1><189>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <18a>   DW_AT_prototyped  : 1
    <18a>   DW_AT_sibling     : <0x194>
 <2><18e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <18f>   DW_AT_type        : <0xac>
 <2><193>: Abbrev Number: 0
 <1><194>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <195>   DW_AT_byte_size   : 4
    <195>   DW_AT_type        : <0x189>
 <1><199>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <19a>   DW_AT_prototyped  : 1
    <19a>   DW_AT_type        : <0xac>
    <19e>   DW_AT_sibling     : <0x1a8>
 <2><1a2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1a3>   DW_AT_type        : <0xc4>
 <2><1a7>: Abbrev Number: 0
 <1><1a8>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1a9>   DW_AT_byte_size   : 4
    <1a9>   DW_AT_type        : <0x199>
 <1><1ad>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <1ae>   DW_AT_prototyped  : 1
    <1ae>   DW_AT_sibling     : <0x1b8>
 <2><1b2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1b3>   DW_AT_type        : <0x1b8>
 <2><1b7>: Abbrev Number: 0
 <1><1b8>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1b9>   DW_AT_byte_size   : 4
    <1b9>   DW_AT_type        : <0xb8>
 <1><1bd>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <1be>   DW_AT_byte_size   : 4
    <1be>   DW_AT_type        : <0x1ad>
 <1><1c2>: Abbrev Number: 5 (DW_TAG_typedef)
    <1c3>   DW_AT_name        : (indirect string, offset: 0x55a6): ACCELERO_DrvTypeDef
    <1c7>   DW_AT_decl_file   : 4
    <1c8>   DW_AT_decl_line   : 83
    <1c9>   DW_AT_decl_column : 2
    <1ca>   DW_AT_type        : <0xd0>
 <1><1ce>: Abbrev Number: 23 (DW_TAG_variable)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x4685): Lsm303agrDrv
    <1d3>   DW_AT_decl_file   : 5
    <1d4>   DW_AT_decl_line   : 480
    <1d6>   DW_AT_decl_column : 28
    <1d7>   DW_AT_type        : <0x1c2>
    <1db>   DW_AT_external    : 1
    <1db>   DW_AT_declaration : 1
 <1><1db>: Abbrev Number: 24 (DW_TAG_variable)
    <1dc>   DW_AT_specification: <0x1ce>
    <1e0>   DW_AT_decl_file   : 1
    <1e1>   DW_AT_decl_line   : 63
    <1e2>   DW_AT_decl_column : 21
    <1e3>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><1e9>: Abbrev Number: 10 (DW_TAG_array_type)
    <1ea>   DW_AT_type        : <0xac>
    <1ee>   DW_AT_sibling     : <0x1f9>
 <2><1f2>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1f3>   DW_AT_type        : <0x99>
    <1f7>   DW_AT_upper_bound : 7
 <2><1f8>: Abbrev Number: 0
 <1><1f9>: Abbrev Number: 15 (DW_TAG_variable)
    <1fa>   DW_AT_name        : (indirect string, offset: 0x543d): tmpreg2A
    <1fe>   DW_AT_decl_file   : 1
    <1fe>   DW_AT_decl_line   : 80
    <1ff>   DW_AT_decl_column : 9
    <1ff>   DW_AT_type        : <0x1e9>
    <203>   DW_AT_external    : 1
    <203>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><209>: Abbrev Number: 15 (DW_TAG_variable)
    <20a>   DW_AT_name        : (indirect string, offset: 0x2987): tmpreg3A
    <20e>   DW_AT_decl_file   : 1
    <20e>   DW_AT_decl_line   : 81
    <20f>   DW_AT_decl_column : 9
    <20f>   DW_AT_type        : <0xac>
    <213>   DW_AT_external    : 1
    <213>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><219>: Abbrev Number: 15 (DW_TAG_variable)
    <21a>   DW_AT_name        : (indirect string, offset: 0x4933): tmpregcfgA
    <21e>   DW_AT_decl_file   : 1
    <21e>   DW_AT_decl_line   : 82
    <21f>   DW_AT_decl_column : 9
    <21f>   DW_AT_type        : <0xac>
    <223>   DW_AT_external    : 1
    <223>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><229>: Abbrev Number: 16 (DW_TAG_subprogram)
    <22a>   DW_AT_external    : 1
    <22a>   DW_AT_name        : (indirect string, offset: 0x4726): COMPASSACCELERO_IO_ITConfig
    <22e>   DW_AT_decl_file   : 5
    <22e>   DW_AT_decl_line   : 475
    <230>   DW_AT_decl_column : 9
    <230>   DW_AT_prototyped  : 1
    <230>   DW_AT_declaration : 1
 <1><230>: Abbrev Number: 25 (DW_TAG_subprogram)
    <231>   DW_AT_external    : 1
    <231>   DW_AT_name        : (indirect string, offset: 0x5500): COMPASSACCELERO_IO_Read
    <235>   DW_AT_decl_file   : 5
    <236>   DW_AT_decl_line   : 477
    <238>   DW_AT_decl_column : 9
    <239>   DW_AT_prototyped  : 1
    <239>   DW_AT_type        : <0xac>
    <23d>   DW_AT_declaration : 1
    <23d>   DW_AT_sibling     : <0x24c>
 <2><241>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <242>   DW_AT_type        : <0xc4>
 <2><246>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <247>   DW_AT_type        : <0xac>
 <2><24b>: Abbrev Number: 0
 <1><24c>: Abbrev Number: 26 (DW_TAG_subprogram)
    <24d>   DW_AT_external    : 1
    <24d>   DW_AT_name        : (indirect string, offset: 0x5446): COMPASSACCELERO_IO_Write
    <251>   DW_AT_decl_file   : 5
    <252>   DW_AT_decl_line   : 476
    <254>   DW_AT_decl_column : 9
    <255>   DW_AT_prototyped  : 1
    <255>   DW_AT_declaration : 1
    <255>   DW_AT_sibling     : <0x269>
 <2><259>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25a>   DW_AT_type        : <0xc4>
 <2><25e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <25f>   DW_AT_type        : <0xac>
 <2><263>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <264>   DW_AT_type        : <0xac>
 <2><268>: Abbrev Number: 0
 <1><269>: Abbrev Number: 16 (DW_TAG_subprogram)
    <26a>   DW_AT_external    : 1
    <26a>   DW_AT_name        : (indirect string, offset: 0x1508): COMPASSACCELERO_IO_Init
    <26e>   DW_AT_decl_file   : 5
    <26e>   DW_AT_decl_line   : 474
    <270>   DW_AT_decl_column : 9
    <270>   DW_AT_prototyped  : 1
    <270>   DW_AT_declaration : 1
 <1><270>: Abbrev Number: 27 (DW_TAG_subprogram)
    <271>   DW_AT_external    : 1
    <271>   DW_AT_name        : (indirect string, offset: 0x1007): LSM303AGR_AccZClickITConfig
    <275>   DW_AT_decl_file   : 1
    <276>   DW_AT_decl_line   : 534
    <278>   DW_AT_decl_column : 6
    <279>   DW_AT_prototyped  : 1
    <279>   DW_AT_low_pc      : 0x80008f4
    <27d>   DW_AT_high_pc     : 0x1e
    <281>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <283>   DW_AT_call_all_tail_calls: 1
 <1><283>: Abbrev Number: 3 (DW_TAG_subprogram)
    <284>   DW_AT_external    : 1
    <284>   DW_AT_name        : (indirect string, offset: 0x4a06): LSM303AGR_AccClickITDisable
    <288>   DW_AT_decl_file   : 1
    <288>   DW_AT_decl_line   : 515
    <28a>   DW_AT_decl_column : 6
    <28a>   DW_AT_prototyped  : 1
    <28a>   DW_AT_low_pc      : 0
    <28e>   DW_AT_high_pc     : 0x40
    <292>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <294>   DW_AT_call_all_tail_calls: 1
    <294>   DW_AT_sibling     : <0x2b6>
 <2><298>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <299>   DW_AT_name        : (indirect string, offset: 0x479e): ITClick
    <29d>   DW_AT_decl_file   : 1
    <29d>   DW_AT_decl_line   : 515
    <29f>   DW_AT_decl_column : 42
    <2a0>   DW_AT_type        : <0xac>
    <2a4>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><2a7>: Abbrev Number: 4 (DW_TAG_variable)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <2ac>   DW_AT_decl_file   : 1
    <2ac>   DW_AT_decl_line   : 517
    <2ae>   DW_AT_decl_column : 11
    <2ae>   DW_AT_type        : <0xac>
    <2b2>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><2b5>: Abbrev Number: 0
 <1><2b6>: Abbrev Number: 3 (DW_TAG_subprogram)
    <2b7>   DW_AT_external    : 1
    <2b7>   DW_AT_name        : (indirect string, offset: 0x1f9b): LSM303AGR_AccClickITEnable
    <2bb>   DW_AT_decl_file   : 1
    <2bb>   DW_AT_decl_line   : 481
    <2bd>   DW_AT_decl_column : 6
    <2bd>   DW_AT_prototyped  : 1
    <2bd>   DW_AT_low_pc      : 0x8000882
    <2c1>   DW_AT_high_pc     : 0x72
    <2c5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2c7>   DW_AT_call_all_tail_calls: 1
    <2c7>   DW_AT_sibling     : <0x2e9>
 <2><2cb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x479e): ITClick
    <2d0>   DW_AT_decl_file   : 1
    <2d0>   DW_AT_decl_line   : 481
    <2d2>   DW_AT_decl_column : 41
    <2d3>   DW_AT_type        : <0xac>
    <2d7>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><2da>: Abbrev Number: 4 (DW_TAG_variable)
    <2db>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <2df>   DW_AT_decl_file   : 1
    <2df>   DW_AT_decl_line   : 483
    <2e1>   DW_AT_decl_column : 11
    <2e1>   DW_AT_type        : <0xac>
    <2e5>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><2e8>: Abbrev Number: 0
 <1><2e9>: Abbrev Number: 3 (DW_TAG_subprogram)
    <2ea>   DW_AT_external    : 1
    <2ea>   DW_AT_name        : (indirect string, offset: 0x5791): LSM303AGR_AccINT2InterruptDisable
    <2ee>   DW_AT_decl_file   : 1
    <2ee>   DW_AT_decl_line   : 462
    <2f0>   DW_AT_decl_column : 6
    <2f0>   DW_AT_prototyped  : 1
    <2f0>   DW_AT_low_pc      : 0
    <2f4>   DW_AT_high_pc     : 0x4c
    <2f8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2fa>   DW_AT_call_all_tail_calls: 1
    <2fa>   DW_AT_sibling     : <0x32b>
 <2><2fe>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x17e5): ITCombination
    <303>   DW_AT_decl_file   : 1
    <303>   DW_AT_decl_line   : 462
    <305>   DW_AT_decl_column : 48
    <306>   DW_AT_type        : <0xac>
    <30a>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><30d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <30e>   DW_AT_name        : (indirect string, offset: 0x2d25): ITAxes
    <312>   DW_AT_decl_file   : 1
    <312>   DW_AT_decl_line   : 462
    <314>   DW_AT_decl_column : 71
    <315>   DW_AT_type        : <0xac>
    <319>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><31c>: Abbrev Number: 4 (DW_TAG_variable)
    <31d>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <321>   DW_AT_decl_file   : 1
    <321>   DW_AT_decl_line   : 464
    <323>   DW_AT_decl_column : 11
    <323>   DW_AT_type        : <0xac>
    <327>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><32a>: Abbrev Number: 0
 <1><32b>: Abbrev Number: 3 (DW_TAG_subprogram)
    <32c>   DW_AT_external    : 1
    <32c>   DW_AT_name        : (indirect string, offset: 0x260b): LSM303AGR_AccINT2InterruptEnable
    <330>   DW_AT_decl_file   : 1
    <330>   DW_AT_decl_line   : 442
    <332>   DW_AT_decl_column : 6
    <332>   DW_AT_prototyped  : 1
    <332>   DW_AT_low_pc      : 0
    <336>   DW_AT_high_pc     : 0x42
    <33a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <33c>   DW_AT_call_all_tail_calls: 1
    <33c>   DW_AT_sibling     : <0x36d>
 <2><340>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <341>   DW_AT_name        : (indirect string, offset: 0x17e5): ITCombination
    <345>   DW_AT_decl_file   : 1
    <345>   DW_AT_decl_line   : 442
    <347>   DW_AT_decl_column : 47
    <348>   DW_AT_type        : <0xac>
    <34c>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><34f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <350>   DW_AT_name        : (indirect string, offset: 0x2d25): ITAxes
    <354>   DW_AT_decl_file   : 1
    <354>   DW_AT_decl_line   : 442
    <356>   DW_AT_decl_column : 70
    <357>   DW_AT_type        : <0xac>
    <35b>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><35e>: Abbrev Number: 4 (DW_TAG_variable)
    <35f>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <363>   DW_AT_decl_file   : 1
    <363>   DW_AT_decl_line   : 444
    <365>   DW_AT_decl_column : 11
    <365>   DW_AT_type        : <0xac>
    <369>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><36c>: Abbrev Number: 0
 <1><36d>: Abbrev Number: 3 (DW_TAG_subprogram)
    <36e>   DW_AT_external    : 1
    <36e>   DW_AT_name        : (indirect string, offset: 0x402b): LSM303AGR_AccINT1InterruptDisable
    <372>   DW_AT_decl_file   : 1
    <372>   DW_AT_decl_line   : 422
    <374>   DW_AT_decl_column : 6
    <374>   DW_AT_prototyped  : 1
    <374>   DW_AT_low_pc      : 0
    <378>   DW_AT_high_pc     : 0x4c
    <37c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <37e>   DW_AT_call_all_tail_calls: 1
    <37e>   DW_AT_sibling     : <0x3af>
 <2><382>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <383>   DW_AT_name        : (indirect string, offset: 0x17e5): ITCombination
    <387>   DW_AT_decl_file   : 1
    <387>   DW_AT_decl_line   : 422
    <389>   DW_AT_decl_column : 48
    <38a>   DW_AT_type        : <0xac>
    <38e>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><391>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <392>   DW_AT_name        : (indirect string, offset: 0x2d25): ITAxes
    <396>   DW_AT_decl_file   : 1
    <396>   DW_AT_decl_line   : 422
    <398>   DW_AT_decl_column : 71
    <399>   DW_AT_type        : <0xac>
    <39d>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><3a0>: Abbrev Number: 4 (DW_TAG_variable)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <3a5>   DW_AT_decl_file   : 1
    <3a5>   DW_AT_decl_line   : 424
    <3a7>   DW_AT_decl_column : 11
    <3a7>   DW_AT_type        : <0xac>
    <3ab>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><3ae>: Abbrev Number: 0
 <1><3af>: Abbrev Number: 3 (DW_TAG_subprogram)
    <3b0>   DW_AT_external    : 1
    <3b0>   DW_AT_name        : (indirect string, offset: 0x3f05): LSM303AGR_AccINT1InterruptEnable
    <3b4>   DW_AT_decl_file   : 1
    <3b4>   DW_AT_decl_line   : 402
    <3b6>   DW_AT_decl_column : 6
    <3b6>   DW_AT_prototyped  : 1
    <3b6>   DW_AT_low_pc      : 0
    <3ba>   DW_AT_high_pc     : 0x42
    <3be>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3c0>   DW_AT_call_all_tail_calls: 1
    <3c0>   DW_AT_sibling     : <0x3f1>
 <2><3c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x17e5): ITCombination
    <3c9>   DW_AT_decl_file   : 1
    <3c9>   DW_AT_decl_line   : 402
    <3cb>   DW_AT_decl_column : 47
    <3cc>   DW_AT_type        : <0xac>
    <3d0>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><3d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <3d4>   DW_AT_name        : (indirect string, offset: 0x2d25): ITAxes
    <3d8>   DW_AT_decl_file   : 1
    <3d8>   DW_AT_decl_line   : 402
    <3da>   DW_AT_decl_column : 70
    <3db>   DW_AT_type        : <0xac>
    <3df>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><3e2>: Abbrev Number: 4 (DW_TAG_variable)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <3e7>   DW_AT_decl_file   : 1
    <3e7>   DW_AT_decl_line   : 404
    <3e9>   DW_AT_decl_column : 11
    <3e9>   DW_AT_type        : <0xac>
    <3ed>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><3f0>: Abbrev Number: 0
 <1><3f1>: Abbrev Number: 3 (DW_TAG_subprogram)
    <3f2>   DW_AT_external    : 1
    <3f2>   DW_AT_name        : (indirect string, offset: 0x56d1): LSM303AGR_AccIT2Disable
    <3f6>   DW_AT_decl_file   : 1
    <3f6>   DW_AT_decl_line   : 382
    <3f8>   DW_AT_decl_column : 6
    <3f8>   DW_AT_prototyped  : 1
    <3f8>   DW_AT_low_pc      : 0
    <3fc>   DW_AT_high_pc     : 0x40
    <400>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <402>   DW_AT_call_all_tail_calls: 1
    <402>   DW_AT_sibling     : <0x424>
 <2><406>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <407>   DW_AT_name        : (indirect string, offset: 0x52d0): LSM303AGR_IT
    <40b>   DW_AT_decl_file   : 1
    <40b>   DW_AT_decl_line   : 382
    <40d>   DW_AT_decl_column : 38
    <40e>   DW_AT_type        : <0xac>
    <412>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><415>: Abbrev Number: 4 (DW_TAG_variable)
    <416>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <41a>   DW_AT_decl_file   : 1
    <41a>   DW_AT_decl_line   : 384
    <41c>   DW_AT_decl_column : 11
    <41c>   DW_AT_type        : <0xac>
    <420>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><423>: Abbrev Number: 0
 <1><424>: Abbrev Number: 3 (DW_TAG_subprogram)
    <425>   DW_AT_external    : 1
    <425>   DW_AT_name        : (indirect string, offset: 0x155a): LSM303AGR_AccIT2Enable
    <429>   DW_AT_decl_file   : 1
    <429>   DW_AT_decl_line   : 356
    <42b>   DW_AT_decl_column : 6
    <42b>   DW_AT_prototyped  : 1
    <42b>   DW_AT_low_pc      : 0
    <42f>   DW_AT_high_pc     : 0x36
    <433>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <435>   DW_AT_call_all_tail_calls: 1
    <435>   DW_AT_sibling     : <0x457>
 <2><439>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <43a>   DW_AT_name        : (indirect string, offset: 0x52d0): LSM303AGR_IT
    <43e>   DW_AT_decl_file   : 1
    <43e>   DW_AT_decl_line   : 356
    <440>   DW_AT_decl_column : 37
    <441>   DW_AT_type        : <0xac>
    <445>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><448>: Abbrev Number: 4 (DW_TAG_variable)
    <449>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <44d>   DW_AT_decl_file   : 1
    <44d>   DW_AT_decl_line   : 358
    <44f>   DW_AT_decl_column : 11
    <44f>   DW_AT_type        : <0xac>
    <453>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><456>: Abbrev Number: 0
 <1><457>: Abbrev Number: 3 (DW_TAG_subprogram)
    <458>   DW_AT_external    : 1
    <458>   DW_AT_name        : (indirect string, offset: 0x1dba): LSM303AGR_AccIT1Disable
    <45c>   DW_AT_decl_file   : 1
    <45c>   DW_AT_decl_line   : 330
    <45e>   DW_AT_decl_column : 6
    <45e>   DW_AT_prototyped  : 1
    <45e>   DW_AT_low_pc      : 0
    <462>   DW_AT_high_pc     : 0x40
    <466>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <468>   DW_AT_call_all_tail_calls: 1
    <468>   DW_AT_sibling     : <0x48a>
 <2><46c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <46d>   DW_AT_name        : (indirect string, offset: 0x52d0): LSM303AGR_IT
    <471>   DW_AT_decl_file   : 1
    <471>   DW_AT_decl_line   : 330
    <473>   DW_AT_decl_column : 38
    <474>   DW_AT_type        : <0xac>
    <478>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><47b>: Abbrev Number: 4 (DW_TAG_variable)
    <47c>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <480>   DW_AT_decl_file   : 1
    <480>   DW_AT_decl_line   : 332
    <482>   DW_AT_decl_column : 11
    <482>   DW_AT_type        : <0xac>
    <486>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><489>: Abbrev Number: 0
 <1><48a>: Abbrev Number: 3 (DW_TAG_subprogram)
    <48b>   DW_AT_external    : 1
    <48b>   DW_AT_name        : (indirect string, offset: 0x1184): LSM303AGR_AccIT1Enable
    <48f>   DW_AT_decl_file   : 1
    <48f>   DW_AT_decl_line   : 303
    <491>   DW_AT_decl_column : 6
    <491>   DW_AT_prototyped  : 1
    <491>   DW_AT_low_pc      : 0x800084c
    <495>   DW_AT_high_pc     : 0x36
    <499>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <49b>   DW_AT_call_all_tail_calls: 1
    <49b>   DW_AT_sibling     : <0x4bd>
 <2><49f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x52d0): LSM303AGR_IT
    <4a4>   DW_AT_decl_file   : 1
    <4a4>   DW_AT_decl_line   : 303
    <4a6>   DW_AT_decl_column : 37
    <4a7>   DW_AT_type        : <0xac>
    <4ab>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><4ae>: Abbrev Number: 4 (DW_TAG_variable)
    <4af>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <4b3>   DW_AT_decl_file   : 1
    <4b3>   DW_AT_decl_line   : 305
    <4b5>   DW_AT_decl_column : 11
    <4b5>   DW_AT_type        : <0xac>
    <4b9>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><4bc>: Abbrev Number: 0
 <1><4bd>: Abbrev Number: 3 (DW_TAG_subprogram)
    <4be>   DW_AT_external    : 1
    <4be>   DW_AT_name        : (indirect string, offset: 0x27a3): LSM303AGR_AccFilterClickCmd
    <4c2>   DW_AT_decl_file   : 1
    <4c2>   DW_AT_decl_line   : 275
    <4c4>   DW_AT_decl_column : 6
    <4c4>   DW_AT_prototyped  : 1
    <4c4>   DW_AT_low_pc      : 0x800080e
    <4c8>   DW_AT_high_pc     : 0x3e
    <4cc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4ce>   DW_AT_call_all_tail_calls: 1
    <4ce>   DW_AT_sibling     : <0x4f0>
 <2><4d2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <4d3>   DW_AT_name        : (indirect string, offset: 0x42a6): HighPassFilterClickState
    <4d7>   DW_AT_decl_file   : 1
    <4d7>   DW_AT_decl_line   : 275
    <4d9>   DW_AT_decl_column : 42
    <4da>   DW_AT_type        : <0xac>
    <4de>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><4e1>: Abbrev Number: 4 (DW_TAG_variable)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x545f): tmpreg
    <4e6>   DW_AT_decl_file   : 1
    <4e6>   DW_AT_decl_line   : 277
    <4e8>   DW_AT_decl_column : 11
    <4e8>   DW_AT_type        : <0xac>
    <4ec>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><4ef>: Abbrev Number: 0
 <1><4f0>: Abbrev Number: 12 (DW_TAG_subprogram)
    <4f1>   DW_AT_external    : 1
    <4f1>   DW_AT_name        : (indirect string, offset: 0x5669): LSM303AGR_AccReadXYZ
    <4f5>   DW_AT_decl_file   : 1
    <4f5>   DW_AT_decl_line   : 206
    <4f6>   DW_AT_decl_column : 6
    <4f6>   DW_AT_prototyped  : 1
    <4f6>   DW_AT_low_pc      : 0x800067e
    <4fa>   DW_AT_high_pc     : 0x190
    <4fe>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <500>   DW_AT_call_all_tail_calls: 1
    <500>   DW_AT_sibling     : <0x558>
 <2><504>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <505>   DW_AT_name        : (indirect string, offset: 0x55ba): pData
    <509>   DW_AT_decl_file   : 1
    <509>   DW_AT_decl_line   : 206
    <50a>   DW_AT_decl_column : 36
    <50b>   DW_AT_type        : <0x1b8>
    <50f>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><512>: Abbrev Number: 8 (DW_TAG_variable)
    <513>   DW_AT_name        : (indirect string, offset: 0x78d): pnRawData
    <517>   DW_AT_decl_file   : 1
    <517>   DW_AT_decl_line   : 208
    <518>   DW_AT_decl_column : 11
    <519>   DW_AT_type        : <0x558>
    <51d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><520>: Abbrev Number: 8 (DW_TAG_variable)
    <521>   DW_AT_name        : (indirect string, offset: 0x303f): ctrlx
    <525>   DW_AT_decl_file   : 1
    <525>   DW_AT_decl_line   : 209
    <526>   DW_AT_decl_column : 11
    <527>   DW_AT_type        : <0x568>
    <52b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><52e>: Abbrev Number: 8 (DW_TAG_variable)
    <52f>   DW_AT_name        : (indirect string, offset: 0x1ea7): buffer
    <533>   DW_AT_decl_file   : 1
    <533>   DW_AT_decl_line   : 210
    <534>   DW_AT_decl_column : 10
    <535>   DW_AT_type        : <0x578>
    <539>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><53c>: Abbrev Number: 28 (DW_TAG_variable)
    <53d>   DW_AT_name        : i
    <53f>   DW_AT_decl_file   : 1
    <540>   DW_AT_decl_line   : 211
    <541>   DW_AT_decl_column : 11
    <542>   DW_AT_type        : <0xac>
    <546>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><549>: Abbrev Number: 8 (DW_TAG_variable)
    <54a>   DW_AT_name        : (indirect string, offset: 0xbf2): sensitivity
    <54e>   DW_AT_decl_file   : 1
    <54e>   DW_AT_decl_line   : 212
    <54f>   DW_AT_decl_column : 11
    <550>   DW_AT_type        : <0xac>
    <554>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><557>: Abbrev Number: 0
 <1><558>: Abbrev Number: 10 (DW_TAG_array_type)
    <559>   DW_AT_type        : <0xb8>
    <55d>   DW_AT_sibling     : <0x568>
 <2><561>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <562>   DW_AT_type        : <0x99>
    <566>   DW_AT_upper_bound : 2
 <2><567>: Abbrev Number: 0
 <1><568>: Abbrev Number: 10 (DW_TAG_array_type)
    <569>   DW_AT_type        : <0xac>
    <56d>   DW_AT_sibling     : <0x578>
 <2><571>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <572>   DW_AT_type        : <0x99>
    <576>   DW_AT_upper_bound : 1
 <2><577>: Abbrev Number: 0
 <1><578>: Abbrev Number: 10 (DW_TAG_array_type)
    <579>   DW_AT_type        : <0xa0>
    <57d>   DW_AT_sibling     : <0x588>
 <2><581>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <582>   DW_AT_type        : <0x99>
    <586>   DW_AT_upper_bound : 5
 <2><587>: Abbrev Number: 0
 <1><588>: Abbrev Number: 12 (DW_TAG_subprogram)
    <589>   DW_AT_external    : 1
    <589>   DW_AT_name        : (indirect string, offset: 0x1c07): LSM303AGR_AccFilterCmd
    <58d>   DW_AT_decl_file   : 1
    <58d>   DW_AT_decl_line   : 186
    <58e>   DW_AT_decl_column : 6
    <58e>   DW_AT_prototyped  : 1
    <58e>   DW_AT_low_pc      : 0x8000644
    <592>   DW_AT_high_pc     : 0x3a
    <596>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <598>   DW_AT_call_all_tail_calls: 1
    <598>   DW_AT_sibling     : <0x5b9>
 <2><59c>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <59d>   DW_AT_name        : (indirect string, offset: 0x2bc3): HighPassFilterState
    <5a1>   DW_AT_decl_file   : 1
    <5a1>   DW_AT_decl_line   : 186
    <5a2>   DW_AT_decl_column : 37
    <5a3>   DW_AT_type        : <0xac>
    <5a7>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><5aa>: Abbrev Number: 8 (DW_TAG_variable)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x545f): tmpreg
    <5af>   DW_AT_decl_file   : 1
    <5af>   DW_AT_decl_line   : 188
    <5b0>   DW_AT_decl_column : 11
    <5b1>   DW_AT_type        : <0xac>
    <5b5>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><5b8>: Abbrev Number: 0
 <1><5b9>: Abbrev Number: 12 (DW_TAG_subprogram)
    <5ba>   DW_AT_external    : 1
    <5ba>   DW_AT_name        : (indirect string, offset: 0x18dd): LSM303AGR_AccFilterConfig
    <5be>   DW_AT_decl_file   : 1
    <5be>   DW_AT_decl_line   : 164
    <5bf>   DW_AT_decl_column : 6
    <5bf>   DW_AT_prototyped  : 1
    <5bf>   DW_AT_low_pc      : 0x800060a
    <5c3>   DW_AT_high_pc     : 0x3a
    <5c7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5c9>   DW_AT_call_all_tail_calls: 1
    <5c9>   DW_AT_sibling     : <0x5ea>
 <2><5cd>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x4cfe): FilterStruct
    <5d2>   DW_AT_decl_file   : 1
    <5d2>   DW_AT_decl_line   : 164
    <5d3>   DW_AT_decl_column : 40
    <5d4>   DW_AT_type        : <0xac>
    <5d8>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><5db>: Abbrev Number: 8 (DW_TAG_variable)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x545f): tmpreg
    <5e0>   DW_AT_decl_file   : 1
    <5e0>   DW_AT_decl_line   : 166
    <5e1>   DW_AT_decl_column : 11
    <5e2>   DW_AT_type        : <0xac>
    <5e6>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><5e9>: Abbrev Number: 0
 <1><5ea>: Abbrev Number: 12 (DW_TAG_subprogram)
    <5eb>   DW_AT_external    : 1
    <5eb>   DW_AT_name        : (indirect string, offset: 0x1df3): LSM303AGR_AccRebootCmd
    <5ef>   DW_AT_decl_file   : 1
    <5ef>   DW_AT_decl_line   : 145
    <5f0>   DW_AT_decl_column : 6
    <5f0>   DW_AT_prototyped  : 1
    <5f0>   DW_AT_low_pc      : 0x80005dc
    <5f4>   DW_AT_high_pc     : 0x2e
    <5f8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5fa>   DW_AT_call_all_tail_calls: 1
    <5fa>   DW_AT_sibling     : <0x60d>
 <2><5fe>: Abbrev Number: 8 (DW_TAG_variable)
    <5ff>   DW_AT_name        : (indirect string, offset: 0x545f): tmpreg
    <603>   DW_AT_decl_file   : 1
    <603>   DW_AT_decl_line   : 147
    <604>   DW_AT_decl_column : 11
    <605>   DW_AT_type        : <0xac>
    <609>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><60c>: Abbrev Number: 0
 <1><60d>: Abbrev Number: 29 (DW_TAG_subprogram)
    <60e>   DW_AT_external    : 1
    <60e>   DW_AT_name        : (indirect string, offset: 0x2e9c): LSM303AGR_AccReadID
    <612>   DW_AT_decl_file   : 1
    <613>   DW_AT_decl_line   : 127
    <614>   DW_AT_decl_column : 9
    <615>   DW_AT_prototyped  : 1
    <615>   DW_AT_type        : <0xac>
    <619>   DW_AT_low_pc      : 0x80005b8
    <61d>   DW_AT_high_pc     : 0x24
    <621>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <623>   DW_AT_call_all_tail_calls: 1
    <623>   DW_AT_sibling     : <0x636>
 <2><627>: Abbrev Number: 8 (DW_TAG_variable)
    <628>   DW_AT_name        : (indirect string, offset: 0x15e4): ctrl
    <62c>   DW_AT_decl_file   : 1
    <62c>   DW_AT_decl_line   : 129
    <62d>   DW_AT_decl_column : 11
    <62e>   DW_AT_type        : <0xac>
    <632>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><635>: Abbrev Number: 0
 <1><636>: Abbrev Number: 30 (DW_TAG_subprogram)
    <637>   DW_AT_external    : 1
    <637>   DW_AT_name        : (indirect string, offset: 0xe1e): LSM303AGR_AccDeInit
    <63b>   DW_AT_decl_file   : 1
    <63c>   DW_AT_decl_line   : 118
    <63d>   DW_AT_decl_column : 6
    <63e>   DW_AT_prototyped  : 1
    <63e>   DW_AT_low_pc      : 0x80005aa
    <642>   DW_AT_high_pc     : 0xe
    <646>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <648>   DW_AT_call_all_calls: 1
 <1><648>: Abbrev Number: 31 (DW_TAG_subprogram)
    <649>   DW_AT_external    : 1
    <649>   DW_AT_name        : (indirect string, offset: 0x2f12): LSM303AGR_AccInit
    <64d>   DW_AT_decl_file   : 1
    <64e>   DW_AT_decl_line   : 97
    <64f>   DW_AT_decl_column : 6
    <650>   DW_AT_prototyped  : 1
    <650>   DW_AT_low_pc      : 0x8000570
    <654>   DW_AT_high_pc     : 0x3a
    <658>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <65a>   DW_AT_call_all_tail_calls: 1
 <2><65a>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <65b>   DW_AT_name        : (indirect string, offset: 0x92981): InitStruct
    <65f>   DW_AT_decl_file   : 1
    <65f>   DW_AT_decl_line   : 97
    <660>   DW_AT_decl_column : 33
    <661>   DW_AT_type        : <0xc4>
    <665>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><668>: Abbrev Number: 8 (DW_TAG_variable)
    <669>   DW_AT_name        : (indirect string, offset: 0x15e4): ctrl
    <66d>   DW_AT_decl_file   : 1
    <66d>   DW_AT_decl_line   : 99
    <66e>   DW_AT_decl_column : 11
    <66f>   DW_AT_type        : <0xac>
    <673>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><676>: Abbrev Number: 0
 <1><677>: Abbrev Number: 0
  Compilation Unit @ offset 0x678:
   Length:        0x634 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x218
   Pointer Size:  4
 <0><684>: Abbrev Number: 16 (DW_TAG_compile_unit)
    <685>   DW_AT_producer    : (indirect string, offset: 0x5103): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -ffast-math -fstack-usage -fcyclomatic-complexity
    <689>   DW_AT_language    : 29	(C11)
    <68a>   DW_AT_name        : (indirect string, offset: 0x6129): ../Components/lsm303dlhc/lsm303dlhc.c
    <68e>   DW_AT_comp_dir    : (indirect string, offset: 0x3887): C:/Users/worbb/Desktop/Electronics/SEMP/sempspace/p2_vibrationsensor_FreeRTOS/Debug
    <692>   DW_AT_ranges      : 0x8c
    <696>   DW_AT_low_pc      : 0
    <69a>   DW_AT_stmt_list   : 0x809
    <69e>   DW_AT_macros      : 0x522
 <1><6a2>: Abbrev Number: 5 (DW_TAG_typedef)
    <6a3>   DW_AT_name        : (indirect string, offset: 0x3d54): __int8_t
    <6a7>   DW_AT_decl_file   : 2
    <6a8>   DW_AT_decl_line   : 41
    <6a9>   DW_AT_decl_column : 23
    <6aa>   DW_AT_type        : <0x6ae>
 <1><6ae>: Abbrev Number: 6 (DW_TAG_base_type)
    <6af>   DW_AT_byte_size   : 1
    <6b0>   DW_AT_encoding    : 6	(signed char)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x379a): signed char
 <1><6b5>: Abbrev Number: 5 (DW_TAG_typedef)
    <6b6>   DW_AT_name        : (indirect string, offset: 0xb00): __uint8_t
    <6ba>   DW_AT_decl_file   : 2
    <6bb>   DW_AT_decl_line   : 43
    <6bc>   DW_AT_decl_column : 24
    <6bd>   DW_AT_type        : <0x6c1>
 <1><6c1>: Abbrev Number: 6 (DW_TAG_base_type)
    <6c2>   DW_AT_byte_size   : 1
    <6c3>   DW_AT_encoding    : 8	(unsigned char)
    <6c4>   DW_AT_name        : (indirect string, offset: 0x3587): unsigned char
 <1><6c8>: Abbrev Number: 5 (DW_TAG_typedef)
    <6c9>   DW_AT_name        : (indirect string, offset: 0x4314): __int16_t
    <6cd>   DW_AT_decl_file   : 2
    <6ce>   DW_AT_decl_line   : 55
    <6cf>   DW_AT_decl_column : 24
    <6d0>   DW_AT_type        : <0x6d4>
 <1><6d4>: Abbrev Number: 6 (DW_TAG_base_type)
    <6d5>   DW_AT_byte_size   : 2
    <6d6>   DW_AT_encoding    : 5	(signed)
    <6d7>   DW_AT_name        : (indirect string, offset: 0x54e): short int
 <1><6db>: Abbrev Number: 5 (DW_TAG_typedef)
    <6dc>   DW_AT_name        : (indirect string, offset: 0x1930): __uint16_t
    <6e0>   DW_AT_decl_file   : 2
    <6e1>   DW_AT_decl_line   : 57
    <6e2>   DW_AT_decl_column : 25
    <6e3>   DW_AT_type        : <0x6e7>
 <1><6e7>: Abbrev Number: 6 (DW_TAG_base_type)
    <6e8>   DW_AT_byte_size   : 2
    <6e9>   DW_AT_encoding    : 7	(unsigned)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x4018): short unsigned int
 <1><6ee>: Abbrev Number: 6 (DW_TAG_base_type)
    <6ef>   DW_AT_byte_size   : 4
    <6f0>   DW_AT_encoding    : 5	(signed)
    <6f1>   DW_AT_name        : (indirect string, offset: 0x4255): long int
 <1><6f5>: Abbrev Number: 6 (DW_TAG_base_type)
    <6f6>   DW_AT_byte_size   : 4
    <6f7>   DW_AT_encoding    : 7	(unsigned)
    <6f8>   DW_AT_name        : (indirect string, offset: 0x104e): long unsigned int
 <1><6fc>: Abbrev Number: 6 (DW_TAG_base_type)
    <6fd>   DW_AT_byte_size   : 8
    <6fe>   DW_AT_encoding    : 5	(signed)
    <6ff>   DW_AT_name        : (indirect string, offset: 0x2dc6): long long int
 <1><703>: Abbrev Number: 6 (DW_TAG_base_type)
    <704>   DW_AT_byte_size   : 8
    <705>   DW_AT_encoding    : 7	(unsigned)
    <706>   DW_AT_name        : (indirect string, offset: 0x4835): long long unsigned int
 <1><70a>: Abbrev Number: 17 (DW_TAG_base_type)
    <70b>   DW_AT_byte_size   : 4
    <70c>   DW_AT_encoding    : 5	(signed)
    <70d>   DW_AT_name        : int
 <1><711>: Abbrev Number: 6 (DW_TAG_base_type)
    <712>   DW_AT_byte_size   : 4
    <713>   DW_AT_encoding    : 7	(unsigned)
    <714>   DW_AT_name        : (indirect string, offset: 0x1474): unsigned int
 <1><718>: Abbrev Number: 5 (DW_TAG_typedef)
    <719>   DW_AT_name        : (indirect string, offset: 0x3d56): int8_t
    <71d>   DW_AT_decl_file   : 3
    <71e>   DW_AT_decl_line   : 20
    <71f>   DW_AT_decl_column : 18
    <720>   DW_AT_type        : <0x6a2>
 <1><724>: Abbrev Number: 5 (DW_TAG_typedef)
    <725>   DW_AT_name        : (indirect string, offset: 0xb02): uint8_t
    <729>   DW_AT_decl_file   : 3
    <72a>   DW_AT_decl_line   : 24
    <72b>   DW_AT_decl_column : 19
    <72c>   DW_AT_type        : <0x6b5>
 <1><730>: Abbrev Number: 5 (DW_TAG_typedef)
    <731>   DW_AT_name        : (indirect string, offset: 0x4316): int16_t
    <735>   DW_AT_decl_file   : 3
    <736>   DW_AT_decl_line   : 32
    <737>   DW_AT_decl_column : 19
    <738>   DW_AT_type        : <0x6c8>
 <1><73c>: Abbrev Number: 5 (DW_TAG_typedef)
    <73d>   DW_AT_name        : (indirect string, offset: 0x6af94): uint16_t
    <741>   DW_AT_decl_file   : 3
    <742>   DW_AT_decl_line   : 36
    <743>   DW_AT_decl_column : 20
    <744>   DW_AT_type        : <0x6db>
 <1><748>: Abbrev Number: 18 (DW_TAG_structure_type)
    <749>   DW_AT_byte_size   : 52
    <74a>   DW_AT_decl_file   : 4
    <74b>   DW_AT_decl_line   : 68
    <74c>   DW_AT_decl_column : 9
    <74d>   DW_AT_sibling     : <0x7e1>
 <2><751>: Abbrev Number: 2 (DW_TAG_member)
    <752>   DW_AT_name        : (indirect string, offset: 0x9564e): Init
    <756>   DW_AT_decl_file   : 4
    <756>   DW_AT_decl_line   : 70
    <757>   DW_AT_decl_column : 15
    <757>   DW_AT_type        : <0x7ec>
    <75b>   DW_AT_data_member_location: 0
 <2><75c>: Abbrev Number: 2 (DW_TAG_member)
    <75d>   DW_AT_name        : (indirect string, offset: 0x9b3f9): DeInit
    <761>   DW_AT_decl_file   : 4
    <761>   DW_AT_decl_line   : 71
    <762>   DW_AT_decl_column : 15
    <762>   DW_AT_type        : <0x7f2>
    <766>   DW_AT_data_member_location: 4
 <2><767>: Abbrev Number: 2 (DW_TAG_member)
    <768>   DW_AT_name        : (indirect string, offset: 0x6227): ReadID
    <76c>   DW_AT_decl_file   : 4
    <76c>   DW_AT_decl_line   : 72
    <76d>   DW_AT_decl_column : 15
    <76d>   DW_AT_type        : <0x7fc>
    <771>   DW_AT_data_member_location: 8
 <2><772>: Abbrev Number: 2 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0xa2ce2): Reset
    <777>   DW_AT_decl_file   : 4
    <777>   DW_AT_decl_line   : 73
    <778>   DW_AT_decl_column : 15
    <778>   DW_AT_type        : <0x7f2>
    <77c>   DW_AT_data_member_location: 12
 <2><77d>: Abbrev Number: 2 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0): LowPower
    <782>   DW_AT_decl_file   : 4
    <782>   DW_AT_decl_line   : 74
    <783>   DW_AT_decl_column : 15
    <783>   DW_AT_type        : <0x7f2>
    <787>   DW_AT_data_member_location: 16
 <2><788>: Abbrev Number: 2 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0x4aa7): ConfigIT
    <78d>   DW_AT_decl_file   : 4
    <78d>   DW_AT_decl_line   : 75
    <78e>   DW_AT_decl_column : 15
    <78e>   DW_AT_type        : <0x7f2>
    <792>   DW_AT_data_member_location: 20
 <2><793>: Abbrev Number: 2 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0x2b58): EnableIT
    <798>   DW_AT_decl_file   : 4
    <798>   DW_AT_decl_line   : 76
    <799>   DW_AT_decl_column : 15
    <799>   DW_AT_type        : <0x80c>
    <79d>   DW_AT_data_member_location: 24
 <2><79e>: Abbrev Number: 2 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0x1acd): DisableIT
    <7a3>   DW_AT_decl_file   : 4
    <7a3>   DW_AT_decl_line   : 77
    <7a4>   DW_AT_decl_column : 15
    <7a4>   DW_AT_type        : <0x80c>
    <7a8>   DW_AT_data_member_location: 28
 <2><7a9>: Abbrev Number: 2 (DW_TAG_member)
    <7aa>   DW_AT_name        : (indirect string, offset: 0x39f2): ITStatus
    <7ae>   DW_AT_decl_file   : 4
    <7ae>   DW_AT_decl_line   : 78
    <7af>   DW_AT_decl_column : 15
    <7af>   DW_AT_type        : <0x820>
    <7b3>   DW_AT_data_member_location: 32
 <2><7b4>: Abbrev Number: 2 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x3b1d): ClearIT
    <7b9>   DW_AT_decl_file   : 4
    <7b9>   DW_AT_decl_line   : 79
    <7ba>   DW_AT_decl_column : 15
    <7ba>   DW_AT_type        : <0x7f2>
    <7be>   DW_AT_data_member_location: 36
 <2><7bf>: Abbrev Number: 2 (DW_TAG_member)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x5d91): FilterConfig
    <7c4>   DW_AT_decl_file   : 4
    <7c4>   DW_AT_decl_line   : 80
    <7c5>   DW_AT_decl_column : 15
    <7c5>   DW_AT_type        : <0x80c>
    <7c9>   DW_AT_data_member_location: 40
 <2><7ca>: Abbrev Number: 2 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x6474): FilterCmd
    <7cf>   DW_AT_decl_file   : 4
    <7cf>   DW_AT_decl_line   : 81
    <7d0>   DW_AT_decl_column : 15
    <7d0>   DW_AT_type        : <0x80c>
    <7d4>   DW_AT_data_member_location: 44
 <2><7d5>: Abbrev Number: 2 (DW_TAG_member)
    <7d6>   DW_AT_name        : (indirect string, offset: 0x98c6b): GetXYZ
    <7da>   DW_AT_decl_file   : 4
    <7da>   DW_AT_decl_line   : 82
    <7db>   DW_AT_decl_column : 15
    <7db>   DW_AT_type        : <0x835>
    <7df>   DW_AT_data_member_location: 48
 <2><7e0>: Abbrev Number: 0
 <1><7e1>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <7e2>   DW_AT_prototyped  : 1
    <7e2>   DW_AT_sibling     : <0x7ec>
 <2><7e6>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <7e7>   DW_AT_type        : <0x73c>
 <2><7eb>: Abbrev Number: 0
 <1><7ec>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <7ed>   DW_AT_byte_size   : 4
    <7ed>   DW_AT_type        : <0x7e1>
 <1><7f1>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <7f2>   DW_AT_prototyped  : 1
 <1><7f2>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <7f3>   DW_AT_byte_size   : 4
    <7f3>   DW_AT_type        : <0x7f1>
 <1><7f7>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <7f8>   DW_AT_prototyped  : 1
    <7f8>   DW_AT_type        : <0x724>
 <1><7fc>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <7fd>   DW_AT_byte_size   : 4
    <7fd>   DW_AT_type        : <0x7f7>
 <1><801>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <802>   DW_AT_prototyped  : 1
    <802>   DW_AT_sibling     : <0x80c>
 <2><806>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <807>   DW_AT_type        : <0x724>
 <2><80b>: Abbrev Number: 0
 <1><80c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <80d>   DW_AT_byte_size   : 4
    <80d>   DW_AT_type        : <0x801>
 <1><811>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <812>   DW_AT_prototyped  : 1
    <812>   DW_AT_type        : <0x724>
    <816>   DW_AT_sibling     : <0x820>
 <2><81a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <81b>   DW_AT_type        : <0x73c>
 <2><81f>: Abbrev Number: 0
 <1><820>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <821>   DW_AT_byte_size   : 4
    <821>   DW_AT_type        : <0x811>
 <1><825>: Abbrev Number: 12 (DW_TAG_subroutine_type)
    <826>   DW_AT_prototyped  : 1
    <826>   DW_AT_sibling     : <0x830>
 <2><82a>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <82b>   DW_AT_type        : <0x830>
 <2><82f>: Abbrev Number: 0
 <1><830>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <831>   DW_AT_byte_size   : 4
    <831>   DW_AT_type        : <0x730>
 <1><835>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <836>   DW_AT_byte_size   : 4
    <836>   DW_AT_type        : <0x825>
 <1><83a>: Abbrev Number: 5 (DW_TAG_typedef)
    <83b>   DW_AT_name        : (indirect string, offset: 0x55a6): ACCELERO_DrvTypeDef
    <83f>   DW_AT_decl_file   : 4
    <840>   DW_AT_decl_line   : 83
    <841>   DW_AT_decl_column : 2
    <842>   DW_AT_type        : <0x748>
 <1><846>: Abbrev Number: 22 (DW_TAG_variable)
    <847>   DW_AT_name        : (indirect string, offset: 0x6f2f): Lsm303dlhcDrv
    <84b>   DW_AT_decl_file   : 5
    <84c>   DW_AT_decl_line   : 455
    <84e>   DW_AT_decl_column : 28
    <84f>   DW_AT_type        : <0x83a>
    <853>   DW_AT_external    : 1
    <853>   DW_AT_declaration : 1
 <1><853>: Abbrev Number: 23 (DW_TAG_variable)
    <854>   DW_AT_specification: <0x846>
    <858>   DW_AT_decl_file   : 1
    <859>   DW_AT_decl_line   : 61
    <85a>   DW_AT_decl_column : 21
    <85b>   DW_AT_location    : 5 byte block: 3 34 0 0 20 	(DW_OP_addr: 20000034)
 <1><861>: Abbrev Number: 15 (DW_TAG_subprogram)
    <862>   DW_AT_external    : 1
    <862>   DW_AT_name        : (indirect string, offset: 0x4726): COMPASSACCELERO_IO_ITConfig
    <866>   DW_AT_decl_file   : 5
    <866>   DW_AT_decl_line   : 450
    <868>   DW_AT_decl_column : 9
    <868>   DW_AT_prototyped  : 1
    <868>   DW_AT_declaration : 1
 <1><868>: Abbrev Number: 24 (DW_TAG_subprogram)
    <869>   DW_AT_external    : 1
    <869>   DW_AT_name        : (indirect string, offset: 0x5500): COMPASSACCELERO_IO_Read
    <86d>   DW_AT_decl_file   : 5
    <86e>   DW_AT_decl_line   : 452
    <870>   DW_AT_decl_column : 9
    <871>   DW_AT_prototyped  : 1
    <871>   DW_AT_type        : <0x724>
    <875>   DW_AT_declaration : 1
    <875>   DW_AT_sibling     : <0x884>
 <2><879>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <87a>   DW_AT_type        : <0x73c>
 <2><87e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <87f>   DW_AT_type        : <0x724>
 <2><883>: Abbrev Number: 0
 <1><884>: Abbrev Number: 25 (DW_TAG_subprogram)
    <885>   DW_AT_external    : 1
    <885>   DW_AT_name        : (indirect string, offset: 0x5446): COMPASSACCELERO_IO_Write
    <889>   DW_AT_decl_file   : 5
    <88a>   DW_AT_decl_line   : 451
    <88c>   DW_AT_decl_column : 9
    <88d>   DW_AT_prototyped  : 1
    <88d>   DW_AT_declaration : 1
    <88d>   DW_AT_sibling     : <0x8a1>
 <2><891>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <892>   DW_AT_type        : <0x73c>
 <2><896>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <897>   DW_AT_type        : <0x724>
 <2><89b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <89c>   DW_AT_type        : <0x724>
 <2><8a0>: Abbrev Number: 0
 <1><8a1>: Abbrev Number: 15 (DW_TAG_subprogram)
    <8a2>   DW_AT_external    : 1
    <8a2>   DW_AT_name        : (indirect string, offset: 0x1508): COMPASSACCELERO_IO_Init
    <8a6>   DW_AT_decl_file   : 5
    <8a6>   DW_AT_decl_line   : 449
    <8a8>   DW_AT_decl_column : 9
    <8a8>   DW_AT_prototyped  : 1
    <8a8>   DW_AT_declaration : 1
 <1><8a8>: Abbrev Number: 26 (DW_TAG_subprogram)
    <8a9>   DW_AT_external    : 1
    <8a9>   DW_AT_name        : (indirect string, offset: 0x6c57): LSM303DLHC_AccZClickITConfig
    <8ad>   DW_AT_decl_file   : 1
    <8ae>   DW_AT_decl_line   : 528
    <8b0>   DW_AT_decl_column : 6
    <8b1>   DW_AT_prototyped  : 1
    <8b1>   DW_AT_low_pc      : 0x8000c9a
    <8b5>   DW_AT_high_pc     : 0x1e
    <8b9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8bb>   DW_AT_call_all_tail_calls: 1
 <1><8bb>: Abbrev Number: 3 (DW_TAG_subprogram)
    <8bc>   DW_AT_external    : 1
    <8bc>   DW_AT_name        : (indirect string, offset: 0x63fc): LSM303DLHC_AccClickITDisable
    <8c0>   DW_AT_decl_file   : 1
    <8c0>   DW_AT_decl_line   : 509
    <8c2>   DW_AT_decl_column : 6
    <8c2>   DW_AT_prototyped  : 1
    <8c2>   DW_AT_low_pc      : 0
    <8c6>   DW_AT_high_pc     : 0x40
    <8ca>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8cc>   DW_AT_call_all_tail_calls: 1
    <8cc>   DW_AT_sibling     : <0x8ee>
 <2><8d0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <8d1>   DW_AT_name        : (indirect string, offset: 0x479e): ITClick
    <8d5>   DW_AT_decl_file   : 1
    <8d5>   DW_AT_decl_line   : 509
    <8d7>   DW_AT_decl_column : 43
    <8d8>   DW_AT_type        : <0x724>
    <8dc>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><8df>: Abbrev Number: 4 (DW_TAG_variable)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <8e4>   DW_AT_decl_file   : 1
    <8e4>   DW_AT_decl_line   : 511
    <8e6>   DW_AT_decl_column : 11
    <8e6>   DW_AT_type        : <0x724>
    <8ea>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><8ed>: Abbrev Number: 0
 <1><8ee>: Abbrev Number: 3 (DW_TAG_subprogram)
    <8ef>   DW_AT_external    : 1
    <8ef>   DW_AT_name        : (indirect string, offset: 0x59a0): LSM303DLHC_AccClickITEnable
    <8f3>   DW_AT_decl_file   : 1
    <8f3>   DW_AT_decl_line   : 475
    <8f5>   DW_AT_decl_column : 6
    <8f5>   DW_AT_prototyped  : 1
    <8f5>   DW_AT_low_pc      : 0x8000c28
    <8f9>   DW_AT_high_pc     : 0x72
    <8fd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8ff>   DW_AT_call_all_tail_calls: 1
    <8ff>   DW_AT_sibling     : <0x921>
 <2><903>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <904>   DW_AT_name        : (indirect string, offset: 0x479e): ITClick
    <908>   DW_AT_decl_file   : 1
    <908>   DW_AT_decl_line   : 475
    <90a>   DW_AT_decl_column : 42
    <90b>   DW_AT_type        : <0x724>
    <90f>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><912>: Abbrev Number: 4 (DW_TAG_variable)
    <913>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <917>   DW_AT_decl_file   : 1
    <917>   DW_AT_decl_line   : 477
    <919>   DW_AT_decl_column : 11
    <919>   DW_AT_type        : <0x724>
    <91d>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><920>: Abbrev Number: 0
 <1><921>: Abbrev Number: 3 (DW_TAG_subprogram)
    <922>   DW_AT_external    : 1
    <922>   DW_AT_name        : (indirect string, offset: 0x604d): LSM303DLHC_AccINT2InterruptDisable
    <926>   DW_AT_decl_file   : 1
    <926>   DW_AT_decl_line   : 456
    <928>   DW_AT_decl_column : 6
    <928>   DW_AT_prototyped  : 1
    <928>   DW_AT_low_pc      : 0
    <92c>   DW_AT_high_pc     : 0x4c
    <930>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <932>   DW_AT_call_all_tail_calls: 1
    <932>   DW_AT_sibling     : <0x963>
 <2><936>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <937>   DW_AT_name        : (indirect string, offset: 0x17e5): ITCombination
    <93b>   DW_AT_decl_file   : 1
    <93b>   DW_AT_decl_line   : 456
    <93d>   DW_AT_decl_column : 49
    <93e>   DW_AT_type        : <0x724>
    <942>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><945>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <946>   DW_AT_name        : (indirect string, offset: 0x2d25): ITAxes
    <94a>   DW_AT_decl_file   : 1
    <94a>   DW_AT_decl_line   : 456
    <94c>   DW_AT_decl_column : 72
    <94d>   DW_AT_type        : <0x724>
    <951>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><954>: Abbrev Number: 4 (DW_TAG_variable)
    <955>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <959>   DW_AT_decl_file   : 1
    <959>   DW_AT_decl_line   : 458
    <95b>   DW_AT_decl_column : 11
    <95b>   DW_AT_type        : <0x724>
    <95f>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><962>: Abbrev Number: 0
 <1><963>: Abbrev Number: 3 (DW_TAG_subprogram)
    <964>   DW_AT_external    : 1
    <964>   DW_AT_name        : (indirect string, offset: 0x5f33): LSM303DLHC_AccINT2InterruptEnable
    <968>   DW_AT_decl_file   : 1
    <968>   DW_AT_decl_line   : 436
    <96a>   DW_AT_decl_column : 6
    <96a>   DW_AT_prototyped  : 1
    <96a>   DW_AT_low_pc      : 0
    <96e>   DW_AT_high_pc     : 0x42
    <972>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <974>   DW_AT_call_all_tail_calls: 1
    <974>   DW_AT_sibling     : <0x9a5>
 <2><978>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <979>   DW_AT_name        : (indirect string, offset: 0x17e5): ITCombination
    <97d>   DW_AT_decl_file   : 1
    <97d>   DW_AT_decl_line   : 436
    <97f>   DW_AT_decl_column : 48
    <980>   DW_AT_type        : <0x724>
    <984>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><987>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <988>   DW_AT_name        : (indirect string, offset: 0x2d25): ITAxes
    <98c>   DW_AT_decl_file   : 1
    <98c>   DW_AT_decl_line   : 436
    <98e>   DW_AT_decl_column : 71
    <98f>   DW_AT_type        : <0x724>
    <993>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><996>: Abbrev Number: 4 (DW_TAG_variable)
    <997>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <99b>   DW_AT_decl_file   : 1
    <99b>   DW_AT_decl_line   : 438
    <99d>   DW_AT_decl_column : 11
    <99d>   DW_AT_type        : <0x724>
    <9a1>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><9a4>: Abbrev Number: 0
 <1><9a5>: Abbrev Number: 3 (DW_TAG_subprogram)
    <9a6>   DW_AT_external    : 1
    <9a6>   DW_AT_name        : (indirect string, offset: 0x618e): LSM303DLHC_AccINT1InterruptDisable
    <9aa>   DW_AT_decl_file   : 1
    <9aa>   DW_AT_decl_line   : 416
    <9ac>   DW_AT_decl_column : 6
    <9ac>   DW_AT_prototyped  : 1
    <9ac>   DW_AT_low_pc      : 0
    <9b0>   DW_AT_high_pc     : 0x4c
    <9b4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9b6>   DW_AT_call_all_tail_calls: 1
    <9b6>   DW_AT_sibling     : <0x9e7>
 <2><9ba>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x17e5): ITCombination
    <9bf>   DW_AT_decl_file   : 1
    <9bf>   DW_AT_decl_line   : 416
    <9c1>   DW_AT_decl_column : 49
    <9c2>   DW_AT_type        : <0x724>
    <9c6>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><9c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9ca>   DW_AT_name        : (indirect string, offset: 0x2d25): ITAxes
    <9ce>   DW_AT_decl_file   : 1
    <9ce>   DW_AT_decl_line   : 416
    <9d0>   DW_AT_decl_column : 72
    <9d1>   DW_AT_type        : <0x724>
    <9d5>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><9d8>: Abbrev Number: 4 (DW_TAG_variable)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <9dd>   DW_AT_decl_file   : 1
    <9dd>   DW_AT_decl_line   : 418
    <9df>   DW_AT_decl_column : 11
    <9df>   DW_AT_type        : <0x724>
    <9e3>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><9e6>: Abbrev Number: 0
 <1><9e7>: Abbrev Number: 3 (DW_TAG_subprogram)
    <9e8>   DW_AT_external    : 1
    <9e8>   DW_AT_name        : (indirect string, offset: 0x65f3): LSM303DLHC_AccINT1InterruptEnable
    <9ec>   DW_AT_decl_file   : 1
    <9ec>   DW_AT_decl_line   : 396
    <9ee>   DW_AT_decl_column : 6
    <9ee>   DW_AT_prototyped  : 1
    <9ee>   DW_AT_low_pc      : 0
    <9f2>   DW_AT_high_pc     : 0x42
    <9f6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9f8>   DW_AT_call_all_tail_calls: 1
    <9f8>   DW_AT_sibling     : <0xa29>
 <2><9fc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x17e5): ITCombination
    <a01>   DW_AT_decl_file   : 1
    <a01>   DW_AT_decl_line   : 396
    <a03>   DW_AT_decl_column : 48
    <a04>   DW_AT_type        : <0x724>
    <a08>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><a0b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x2d25): ITAxes
    <a10>   DW_AT_decl_file   : 1
    <a10>   DW_AT_decl_line   : 396
    <a12>   DW_AT_decl_column : 71
    <a13>   DW_AT_type        : <0x724>
    <a17>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><a1a>: Abbrev Number: 4 (DW_TAG_variable)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <a1f>   DW_AT_decl_file   : 1
    <a1f>   DW_AT_decl_line   : 398
    <a21>   DW_AT_decl_column : 11
    <a21>   DW_AT_type        : <0x724>
    <a25>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><a28>: Abbrev Number: 0
 <1><a29>: Abbrev Number: 3 (DW_TAG_subprogram)
    <a2a>   DW_AT_external    : 1
    <a2a>   DW_AT_name        : (indirect string, offset: 0x58a5): LSM303DLHC_AccIT2Disable
    <a2e>   DW_AT_decl_file   : 1
    <a2e>   DW_AT_decl_line   : 376
    <a30>   DW_AT_decl_column : 6
    <a30>   DW_AT_prototyped  : 1
    <a30>   DW_AT_low_pc      : 0
    <a34>   DW_AT_high_pc     : 0x40
    <a38>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a3a>   DW_AT_call_all_tail_calls: 1
    <a3a>   DW_AT_sibling     : <0xa5c>
 <2><a3e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a3f>   DW_AT_name        : (indirect string, offset: 0x6365): LSM303DLHC_IT
    <a43>   DW_AT_decl_file   : 1
    <a43>   DW_AT_decl_line   : 376
    <a45>   DW_AT_decl_column : 39
    <a46>   DW_AT_type        : <0x724>
    <a4a>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><a4d>: Abbrev Number: 4 (DW_TAG_variable)
    <a4e>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <a52>   DW_AT_decl_file   : 1
    <a52>   DW_AT_decl_line   : 378
    <a54>   DW_AT_decl_column : 11
    <a54>   DW_AT_type        : <0x724>
    <a58>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><a5b>: Abbrev Number: 0
 <1><a5c>: Abbrev Number: 3 (DW_TAG_subprogram)
    <a5d>   DW_AT_external    : 1
    <a5d>   DW_AT_name        : (indirect string, offset: 0x6ae2): LSM303DLHC_AccIT2Enable
    <a61>   DW_AT_decl_file   : 1
    <a61>   DW_AT_decl_line   : 350
    <a63>   DW_AT_decl_column : 6
    <a63>   DW_AT_prototyped  : 1
    <a63>   DW_AT_low_pc      : 0
    <a67>   DW_AT_high_pc     : 0x36
    <a6b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a6d>   DW_AT_call_all_tail_calls: 1
    <a6d>   DW_AT_sibling     : <0xa8f>
 <2><a71>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a72>   DW_AT_name        : (indirect string, offset: 0x6365): LSM303DLHC_IT
    <a76>   DW_AT_decl_file   : 1
    <a76>   DW_AT_decl_line   : 350
    <a78>   DW_AT_decl_column : 38
    <a79>   DW_AT_type        : <0x724>
    <a7d>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><a80>: Abbrev Number: 4 (DW_TAG_variable)
    <a81>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <a85>   DW_AT_decl_file   : 1
    <a85>   DW_AT_decl_line   : 352
    <a87>   DW_AT_decl_column : 11
    <a87>   DW_AT_type        : <0x724>
    <a8b>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><a8e>: Abbrev Number: 0
 <1><a8f>: Abbrev Number: 3 (DW_TAG_subprogram)
    <a90>   DW_AT_external    : 1
    <a90>   DW_AT_name        : (indirect string, offset: 0x614f): LSM303DLHC_AccIT1Disable
    <a94>   DW_AT_decl_file   : 1
    <a94>   DW_AT_decl_line   : 324
    <a96>   DW_AT_decl_column : 6
    <a96>   DW_AT_prototyped  : 1
    <a96>   DW_AT_low_pc      : 0
    <a9a>   DW_AT_high_pc     : 0x40
    <a9e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aa0>   DW_AT_call_all_tail_calls: 1
    <aa0>   DW_AT_sibling     : <0xac2>
 <2><aa4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <aa5>   DW_AT_name        : (indirect string, offset: 0x6365): LSM303DLHC_IT
    <aa9>   DW_AT_decl_file   : 1
    <aa9>   DW_AT_decl_line   : 324
    <aab>   DW_AT_decl_column : 39
    <aac>   DW_AT_type        : <0x724>
    <ab0>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><ab3>: Abbrev Number: 4 (DW_TAG_variable)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <ab8>   DW_AT_decl_file   : 1
    <ab8>   DW_AT_decl_line   : 326
    <aba>   DW_AT_decl_column : 11
    <aba>   DW_AT_type        : <0x724>
    <abe>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><ac1>: Abbrev Number: 0
 <1><ac2>: Abbrev Number: 3 (DW_TAG_subprogram)
    <ac3>   DW_AT_external    : 1
    <ac3>   DW_AT_name        : (indirect string, offset: 0x6a0a): LSM303DLHC_AccIT1Enable
    <ac7>   DW_AT_decl_file   : 1
    <ac7>   DW_AT_decl_line   : 297
    <ac9>   DW_AT_decl_column : 6
    <ac9>   DW_AT_prototyped  : 1
    <ac9>   DW_AT_low_pc      : 0x8000bf2
    <acd>   DW_AT_high_pc     : 0x36
    <ad1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ad3>   DW_AT_call_all_tail_calls: 1
    <ad3>   DW_AT_sibling     : <0xaf5>
 <2><ad7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <ad8>   DW_AT_name        : (indirect string, offset: 0x6365): LSM303DLHC_IT
    <adc>   DW_AT_decl_file   : 1
    <adc>   DW_AT_decl_line   : 297
    <ade>   DW_AT_decl_column : 38
    <adf>   DW_AT_type        : <0x724>
    <ae3>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><ae6>: Abbrev Number: 4 (DW_TAG_variable)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x2642): tmpval
    <aeb>   DW_AT_decl_file   : 1
    <aeb>   DW_AT_decl_line   : 299
    <aed>   DW_AT_decl_column : 11
    <aed>   DW_AT_type        : <0x724>
    <af1>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><af4>: Abbrev Number: 0
 <1><af5>: Abbrev Number: 3 (DW_TAG_subprogram)
    <af6>   DW_AT_external    : 1
    <af6>   DW_AT_name        : (indirect string, offset: 0x627c): LSM303DLHC_AccFilterClickCmd
    <afa>   DW_AT_decl_file   : 1
    <afa>   DW_AT_decl_line   : 269
    <afc>   DW_AT_decl_column : 6
    <afc>   DW_AT_prototyped  : 1
    <afc>   DW_AT_low_pc      : 0x8000bb4
    <b00>   DW_AT_high_pc     : 0x3e
    <b04>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b06>   DW_AT_call_all_tail_calls: 1
    <b06>   DW_AT_sibling     : <0xb28>
 <2><b0a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x42a6): HighPassFilterClickState
    <b0f>   DW_AT_decl_file   : 1
    <b0f>   DW_AT_decl_line   : 269
    <b11>   DW_AT_decl_column : 43
    <b12>   DW_AT_type        : <0x724>
    <b16>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><b19>: Abbrev Number: 4 (DW_TAG_variable)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x545f): tmpreg
    <b1e>   DW_AT_decl_file   : 1
    <b1e>   DW_AT_decl_line   : 271
    <b20>   DW_AT_decl_column : 11
    <b20>   DW_AT_type        : <0x724>
    <b24>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b27>: Abbrev Number: 0
 <1><b28>: Abbrev Number: 10 (DW_TAG_subprogram)
    <b29>   DW_AT_external    : 1
    <b29>   DW_AT_name        : (indirect string, offset: 0x6c9a): LSM303DLHC_AccReadXYZ
    <b2d>   DW_AT_decl_file   : 1
    <b2d>   DW_AT_decl_line   : 200
    <b2e>   DW_AT_decl_column : 6
    <b2e>   DW_AT_prototyped  : 1
    <b2e>   DW_AT_low_pc      : 0x8000a24
    <b32>   DW_AT_high_pc     : 0x190
    <b36>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b38>   DW_AT_call_all_tail_calls: 1
    <b38>   DW_AT_sibling     : <0xb90>
 <2><b3c>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <b3d>   DW_AT_name        : (indirect string, offset: 0x55ba): pData
    <b41>   DW_AT_decl_file   : 1
    <b41>   DW_AT_decl_line   : 200
    <b42>   DW_AT_decl_column : 37
    <b43>   DW_AT_type        : <0x830>
    <b47>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><b4a>: Abbrev Number: 8 (DW_TAG_variable)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x78d): pnRawData
    <b4f>   DW_AT_decl_file   : 1
    <b4f>   DW_AT_decl_line   : 202
    <b50>   DW_AT_decl_column : 11
    <b51>   DW_AT_type        : <0xb90>
    <b55>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b58>: Abbrev Number: 8 (DW_TAG_variable)
    <b59>   DW_AT_name        : (indirect string, offset: 0x303f): ctrlx
    <b5d>   DW_AT_decl_file   : 1
    <b5d>   DW_AT_decl_line   : 203
    <b5e>   DW_AT_decl_column : 11
    <b5f>   DW_AT_type        : <0xba0>
    <b63>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b66>: Abbrev Number: 8 (DW_TAG_variable)
    <b67>   DW_AT_name        : (indirect string, offset: 0x1ea7): buffer
    <b6b>   DW_AT_decl_file   : 1
    <b6b>   DW_AT_decl_line   : 204
    <b6c>   DW_AT_decl_column : 10
    <b6d>   DW_AT_type        : <0xbb0>
    <b71>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b74>: Abbrev Number: 27 (DW_TAG_variable)
    <b75>   DW_AT_name        : i
    <b77>   DW_AT_decl_file   : 1
    <b78>   DW_AT_decl_line   : 205
    <b79>   DW_AT_decl_column : 11
    <b7a>   DW_AT_type        : <0x724>
    <b7e>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b81>: Abbrev Number: 8 (DW_TAG_variable)
    <b82>   DW_AT_name        : (indirect string, offset: 0xbf2): sensitivity
    <b86>   DW_AT_decl_file   : 1
    <b86>   DW_AT_decl_line   : 206
    <b87>   DW_AT_decl_column : 11
    <b88>   DW_AT_type        : <0x724>
    <b8c>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><b8f>: Abbrev Number: 0
 <1><b90>: Abbrev Number: 13 (DW_TAG_array_type)
    <b91>   DW_AT_type        : <0x730>
    <b95>   DW_AT_sibling     : <0xba0>
 <2><b99>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <b9a>   DW_AT_type        : <0x711>
    <b9e>   DW_AT_upper_bound : 2
 <2><b9f>: Abbrev Number: 0
 <1><ba0>: Abbrev Number: 13 (DW_TAG_array_type)
    <ba1>   DW_AT_type        : <0x724>
    <ba5>   DW_AT_sibling     : <0xbb0>
 <2><ba9>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <baa>   DW_AT_type        : <0x711>
    <bae>   DW_AT_upper_bound : 1
 <2><baf>: Abbrev Number: 0
 <1><bb0>: Abbrev Number: 13 (DW_TAG_array_type)
    <bb1>   DW_AT_type        : <0x718>
    <bb5>   DW_AT_sibling     : <0xbc0>
 <2><bb9>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <bba>   DW_AT_type        : <0x711>
    <bbe>   DW_AT_upper_bound : 5
 <2><bbf>: Abbrev Number: 0
 <1><bc0>: Abbrev Number: 10 (DW_TAG_subprogram)
    <bc1>   DW_AT_external    : 1
    <bc1>   DW_AT_name        : (indirect string, offset: 0x6466): LSM303DLHC_AccFilterCmd
    <bc5>   DW_AT_decl_file   : 1
    <bc5>   DW_AT_decl_line   : 180
    <bc6>   DW_AT_decl_column : 6
    <bc6>   DW_AT_prototyped  : 1
    <bc6>   DW_AT_low_pc      : 0x80009ea
    <bca>   DW_AT_high_pc     : 0x3a
    <bce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bd0>   DW_AT_call_all_tail_calls: 1
    <bd0>   DW_AT_sibling     : <0xbf1>
 <2><bd4>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x2bc3): HighPassFilterState
    <bd9>   DW_AT_decl_file   : 1
    <bd9>   DW_AT_decl_line   : 180
    <bda>   DW_AT_decl_column : 38
    <bdb>   DW_AT_type        : <0x724>
    <bdf>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><be2>: Abbrev Number: 8 (DW_TAG_variable)
    <be3>   DW_AT_name        : (indirect string, offset: 0x545f): tmpreg
    <be7>   DW_AT_decl_file   : 1
    <be7>   DW_AT_decl_line   : 182
    <be8>   DW_AT_decl_column : 11
    <be9>   DW_AT_type        : <0x724>
    <bed>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><bf0>: Abbrev Number: 0
 <1><bf1>: Abbrev Number: 10 (DW_TAG_subprogram)
    <bf2>   DW_AT_external    : 1
    <bf2>   DW_AT_name        : (indirect string, offset: 0x5d83): LSM303DLHC_AccFilterConfig
    <bf6>   DW_AT_decl_file   : 1
    <bf6>   DW_AT_decl_line   : 158
    <bf7>   DW_AT_decl_column : 6
    <bf7>   DW_AT_prototyped  : 1
    <bf7>   DW_AT_low_pc      : 0x80009b0
    <bfb>   DW_AT_high_pc     : 0x3a
    <bff>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c01>   DW_AT_call_all_tail_calls: 1
    <c01>   DW_AT_sibling     : <0xc22>
 <2><c05>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <c06>   DW_AT_name        : (indirect string, offset: 0x4cfe): FilterStruct
    <c0a>   DW_AT_decl_file   : 1
    <c0a>   DW_AT_decl_line   : 158
    <c0b>   DW_AT_decl_column : 41
    <c0c>   DW_AT_type        : <0x724>
    <c10>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><c13>: Abbrev Number: 8 (DW_TAG_variable)
    <c14>   DW_AT_name        : (indirect string, offset: 0x545f): tmpreg
    <c18>   DW_AT_decl_file   : 1
    <c18>   DW_AT_decl_line   : 160
    <c19>   DW_AT_decl_column : 11
    <c1a>   DW_AT_type        : <0x724>
    <c1e>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><c21>: Abbrev Number: 0
 <1><c22>: Abbrev Number: 10 (DW_TAG_subprogram)
    <c23>   DW_AT_external    : 1
    <c23>   DW_AT_name        : (indirect string, offset: 0x6d1f): LSM303DLHC_AccRebootCmd
    <c27>   DW_AT_decl_file   : 1
    <c27>   DW_AT_decl_line   : 139
    <c28>   DW_AT_decl_column : 6
    <c28>   DW_AT_prototyped  : 1
    <c28>   DW_AT_low_pc      : 0x8000982
    <c2c>   DW_AT_high_pc     : 0x2e
    <c30>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c32>   DW_AT_call_all_tail_calls: 1
    <c32>   DW_AT_sibling     : <0xc45>
 <2><c36>: Abbrev Number: 8 (DW_TAG_variable)
    <c37>   DW_AT_name        : (indirect string, offset: 0x545f): tmpreg
    <c3b>   DW_AT_decl_file   : 1
    <c3b>   DW_AT_decl_line   : 141
    <c3c>   DW_AT_decl_column : 11
    <c3d>   DW_AT_type        : <0x724>
    <c41>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><c44>: Abbrev Number: 0
 <1><c45>: Abbrev Number: 28 (DW_TAG_subprogram)
    <c46>   DW_AT_external    : 1
    <c46>   DW_AT_name        : (indirect string, offset: 0x6219): LSM303DLHC_AccReadID
    <c4a>   DW_AT_decl_file   : 1
    <c4b>   DW_AT_decl_line   : 121
    <c4c>   DW_AT_decl_column : 9
    <c4d>   DW_AT_prototyped  : 1
    <c4d>   DW_AT_type        : <0x724>
    <c51>   DW_AT_low_pc      : 0x800095e
    <c55>   DW_AT_high_pc     : 0x24
    <c59>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c5b>   DW_AT_call_all_tail_calls: 1
    <c5b>   DW_AT_sibling     : <0xc6e>
 <2><c5f>: Abbrev Number: 8 (DW_TAG_variable)
    <c60>   DW_AT_name        : (indirect string, offset: 0x15e4): ctrl
    <c64>   DW_AT_decl_file   : 1
    <c64>   DW_AT_decl_line   : 123
    <c65>   DW_AT_decl_column : 11
    <c66>   DW_AT_type        : <0x724>
    <c6a>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><c6d>: Abbrev Number: 0
 <1><c6e>: Abbrev Number: 29 (DW_TAG_subprogram)
    <c6f>   DW_AT_external    : 1
    <c6f>   DW_AT_name        : (indirect string, offset: 0x6305): LSM303DLHC_AccDeInit
    <c73>   DW_AT_decl_file   : 1
    <c74>   DW_AT_decl_line   : 112
    <c75>   DW_AT_decl_column : 6
    <c76>   DW_AT_prototyped  : 1
    <c76>   DW_AT_low_pc      : 0x8000950
    <c7a>   DW_AT_high_pc     : 0xe
    <c7e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c80>   DW_AT_call_all_calls: 1
 <1><c80>: Abbrev Number: 30 (DW_TAG_subprogram)
    <c81>   DW_AT_external    : 1
    <c81>   DW_AT_name        : (indirect string, offset: 0x6453): LSM303DLHC_AccInit
    <c85>   DW_AT_decl_file   : 1
    <c86>   DW_AT_decl_line   : 91
    <c87>   DW_AT_decl_column : 6
    <c88>   DW_AT_prototyped  : 1
    <c88>   DW_AT_low_pc      : 0x8000912
    <c8c>   DW_AT_high_pc     : 0x3e
    <c90>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c92>   DW_AT_call_all_tail_calls: 1
 <2><c92>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <c93>   DW_AT_name        : (indirect string, offset: 0x92981): InitStruct
    <c97>   DW_AT_decl_file   : 1
    <c97>   DW_AT_decl_line   : 91
    <c98>   DW_AT_decl_column : 34
    <c99>   DW_AT_type        : <0x73c>
    <c9d>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><ca0>: Abbrev Number: 8 (DW_TAG_variable)
    <ca1>   DW_AT_name        : (indirect string, offset: 0x15e4): ctrl
    <ca5>   DW_AT_decl_file   : 1
    <ca5>   DW_AT_decl_line   : 93
    <ca6>   DW_AT_decl_column : 11
    <ca7>   DW_AT_type        : <0x724>
    <cab>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><cae>: Abbrev Number: 0
 <1><caf>: Abbrev Number: 0
  Compilation Unit @ offset 0xcb0:
   Length:        0x241 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x41b
   Pointer Size:  4
 <0><cbc>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <cbd>   DW_AT_producer    : (indirect string, offset: 0x5103): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -ffast-math -fstack-usage -fcyclomatic-complexity
    <cc1>   DW_AT_language    : 29	(C11)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x8ebad): ../Core/Src/freertos.c
    <cc6>   DW_AT_comp_dir    : (indirect string, offset: 0x3887): C:/Users/worbb/Desktop/Electronics/SEMP/sempspace/p2_vibrationsensor_FreeRTOS/Debug
    <cca>   DW_AT_ranges      : 0x10c
    <cce>   DW_AT_low_pc      : 0
    <cd2>   DW_AT_stmt_list   : 0x1019
    <cd6>   DW_AT_macros      : 0x9eb
 <1><cda>: Abbrev Number: 7 (DW_TAG_base_type)
    <cdb>   DW_AT_byte_size   : 4
    <cdc>   DW_AT_encoding    : 5	(signed)
    <cdd>   DW_AT_name        : int
 <1><ce1>: Abbrev Number: 2 (DW_TAG_base_type)
    <ce2>   DW_AT_byte_size   : 4
    <ce3>   DW_AT_encoding    : 7	(unsigned)
    <ce4>   DW_AT_name        : (indirect string, offset: 0x1474): unsigned int
 <1><ce8>: Abbrev Number: 2 (DW_TAG_base_type)
    <ce9>   DW_AT_byte_size   : 8
    <cea>   DW_AT_encoding    : 5	(signed)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x2dc6): long long int
 <1><cef>: Abbrev Number: 2 (DW_TAG_base_type)
    <cf0>   DW_AT_byte_size   : 8
    <cf1>   DW_AT_encoding    : 4	(float)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x77bc3): long double
 <1><cf6>: Abbrev Number: 2 (DW_TAG_base_type)
    <cf7>   DW_AT_byte_size   : 1
    <cf8>   DW_AT_encoding    : 6	(signed char)
    <cf9>   DW_AT_name        : (indirect string, offset: 0x379a): signed char
 <1><cfd>: Abbrev Number: 2 (DW_TAG_base_type)
    <cfe>   DW_AT_byte_size   : 1
    <cff>   DW_AT_encoding    : 8	(unsigned char)
    <d00>   DW_AT_name        : (indirect string, offset: 0x3587): unsigned char
 <1><d04>: Abbrev Number: 2 (DW_TAG_base_type)
    <d05>   DW_AT_byte_size   : 2
    <d06>   DW_AT_encoding    : 5	(signed)
    <d07>   DW_AT_name        : (indirect string, offset: 0x54e): short int
 <1><d0b>: Abbrev Number: 2 (DW_TAG_base_type)
    <d0c>   DW_AT_byte_size   : 2
    <d0d>   DW_AT_encoding    : 7	(unsigned)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x4018): short unsigned int
 <1><d12>: Abbrev Number: 2 (DW_TAG_base_type)
    <d13>   DW_AT_byte_size   : 4
    <d14>   DW_AT_encoding    : 5	(signed)
    <d15>   DW_AT_name        : (indirect string, offset: 0x4255): long int
 <1><d19>: Abbrev Number: 3 (DW_TAG_typedef)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x5df49): __uint32_t
    <d1e>   DW_AT_decl_file   : 2
    <d1f>   DW_AT_decl_line   : 79
    <d20>   DW_AT_decl_column : 25
    <d21>   DW_AT_type        : <0xd25>
 <1><d25>: Abbrev Number: 2 (DW_TAG_base_type)
    <d26>   DW_AT_byte_size   : 4
    <d27>   DW_AT_encoding    : 7	(unsigned)
    <d28>   DW_AT_name        : (indirect string, offset: 0x104e): long unsigned int
 <1><d2c>: Abbrev Number: 2 (DW_TAG_base_type)
    <d2d>   DW_AT_byte_size   : 8
    <d2e>   DW_AT_encoding    : 7	(unsigned)
    <d2f>   DW_AT_name        : (indirect string, offset: 0x4835): long long unsigned int
 <1><d33>: Abbrev Number: 3 (DW_TAG_typedef)
    <d34>   DW_AT_name        : (indirect string, offset: 0x6a8a3): uint32_t
    <d38>   DW_AT_decl_file   : 3
    <d39>   DW_AT_decl_line   : 48
    <d3a>   DW_AT_decl_column : 20
    <d3b>   DW_AT_type        : <0xd19>
 <1><d3f>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <d40>   DW_AT_type        : <0xd33>
 <1><d44>: Abbrev Number: 9 (DW_TAG_const_type)
    <d45>   DW_AT_type        : <0xd3f>
 <1><d49>: Abbrev Number: 2 (DW_TAG_base_type)
    <d4a>   DW_AT_byte_size   : 1
    <d4b>   DW_AT_encoding    : 8	(unsigned char)
    <d4c>   DW_AT_name        : (indirect string, offset: 0x332a2): char
 <1><d50>: Abbrev Number: 10 (DW_TAG_array_type)
    <d51>   DW_AT_type        : <0xd33>
    <d55>   DW_AT_sibling     : <0xd60>
 <2><d59>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <d5a>   DW_AT_type        : <0xce1>
    <d5e>   DW_AT_upper_bound : 0
 <2><d5f>: Abbrev Number: 0
 <1><d60>: Abbrev Number: 4 (DW_TAG_structure_type)
    <d61>   DW_AT_byte_size   : 92
    <d62>   DW_AT_decl_file   : 4
    <d62>   DW_AT_decl_line   : 904
    <d64>   DW_AT_decl_column : 9
    <d64>   DW_AT_sibling     : <0xe7d>
 <2><d68>: Abbrev Number: 1 (DW_TAG_member)
    <d69>   DW_AT_name        : (indirect string, offset: 0x52431): CTRL
    <d6d>   DW_AT_decl_file   : 4
    <d6d>   DW_AT_decl_line   : 906
    <d6f>   DW_AT_decl_column : 18
    <d6f>   DW_AT_type        : <0xd3f>
    <d73>   DW_AT_data_member_location: 0
 <2><d74>: Abbrev Number: 1 (DW_TAG_member)
    <d75>   DW_AT_name        : (indirect string, offset: 0x30968): CYCCNT
    <d79>   DW_AT_decl_file   : 4
    <d79>   DW_AT_decl_line   : 907
    <d7b>   DW_AT_decl_column : 18
    <d7b>   DW_AT_type        : <0xd3f>
    <d7f>   DW_AT_data_member_location: 4
 <2><d80>: Abbrev Number: 1 (DW_TAG_member)
    <d81>   DW_AT_name        : (indirect string, offset: 0x4f53f): CPICNT
    <d85>   DW_AT_decl_file   : 4
    <d85>   DW_AT_decl_line   : 908
    <d87>   DW_AT_decl_column : 18
    <d87>   DW_AT_type        : <0xd3f>
    <d8b>   DW_AT_data_member_location: 8
 <2><d8c>: Abbrev Number: 1 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x7b896): EXCCNT
    <d91>   DW_AT_decl_file   : 4
    <d91>   DW_AT_decl_line   : 909
    <d93>   DW_AT_decl_column : 18
    <d93>   DW_AT_type        : <0xd3f>
    <d97>   DW_AT_data_member_location: 12
 <2><d98>: Abbrev Number: 1 (DW_TAG_member)
    <d99>   DW_AT_name        : (indirect string, offset: 0x35616): SLEEPCNT
    <d9d>   DW_AT_decl_file   : 4
    <d9d>   DW_AT_decl_line   : 910
    <d9f>   DW_AT_decl_column : 18
    <d9f>   DW_AT_type        : <0xd3f>
    <da3>   DW_AT_data_member_location: 16
 <2><da4>: Abbrev Number: 1 (DW_TAG_member)
    <da5>   DW_AT_name        : (indirect string, offset: 0x12f31): LSUCNT
    <da9>   DW_AT_decl_file   : 4
    <da9>   DW_AT_decl_line   : 911
    <dab>   DW_AT_decl_column : 18
    <dab>   DW_AT_type        : <0xd3f>
    <daf>   DW_AT_data_member_location: 20
 <2><db0>: Abbrev Number: 1 (DW_TAG_member)
    <db1>   DW_AT_name        : (indirect string, offset: 0x5f07d): FOLDCNT
    <db5>   DW_AT_decl_file   : 4
    <db5>   DW_AT_decl_line   : 912
    <db7>   DW_AT_decl_column : 18
    <db7>   DW_AT_type        : <0xd3f>
    <dbb>   DW_AT_data_member_location: 24
 <2><dbc>: Abbrev Number: 1 (DW_TAG_member)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x5a4a4): PCSR
    <dc1>   DW_AT_decl_file   : 4
    <dc1>   DW_AT_decl_line   : 913
    <dc3>   DW_AT_decl_column : 18
    <dc3>   DW_AT_type        : <0xd44>
    <dc7>   DW_AT_data_member_location: 28
 <2><dc8>: Abbrev Number: 1 (DW_TAG_member)
    <dc9>   DW_AT_name        : (indirect string, offset: 0xee7b): COMP0
    <dcd>   DW_AT_decl_file   : 4
    <dcd>   DW_AT_decl_line   : 914
    <dcf>   DW_AT_decl_column : 18
    <dcf>   DW_AT_type        : <0xd3f>
    <dd3>   DW_AT_data_member_location: 32
 <2><dd4>: Abbrev Number: 1 (DW_TAG_member)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x4b971): MASK0
    <dd9>   DW_AT_decl_file   : 4
    <dd9>   DW_AT_decl_line   : 915
    <ddb>   DW_AT_decl_column : 18
    <ddb>   DW_AT_type        : <0xd3f>
    <ddf>   DW_AT_data_member_location: 36
 <2><de0>: Abbrev Number: 1 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0x8e4a): FUNCTION0
    <de5>   DW_AT_decl_file   : 4
    <de5>   DW_AT_decl_line   : 916
    <de7>   DW_AT_decl_column : 18
    <de7>   DW_AT_type        : <0xd3f>
    <deb>   DW_AT_data_member_location: 40
 <2><dec>: Abbrev Number: 1 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0x88d35): RESERVED0
    <df1>   DW_AT_decl_file   : 4
    <df1>   DW_AT_decl_line   : 917
    <df3>   DW_AT_decl_column : 18
    <df3>   DW_AT_type        : <0xd50>
    <df7>   DW_AT_data_member_location: 44
 <2><df8>: Abbrev Number: 1 (DW_TAG_member)
    <df9>   DW_AT_name        : (indirect string, offset: 0x4e65d): COMP1
    <dfd>   DW_AT_decl_file   : 4
    <dfd>   DW_AT_decl_line   : 918
    <dff>   DW_AT_decl_column : 18
    <dff>   DW_AT_type        : <0xd3f>
    <e03>   DW_AT_data_member_location: 48
 <2><e04>: Abbrev Number: 1 (DW_TAG_member)
    <e05>   DW_AT_name        : (indirect string, offset: 0x4b977): MASK1
    <e09>   DW_AT_decl_file   : 4
    <e09>   DW_AT_decl_line   : 919
    <e0b>   DW_AT_decl_column : 18
    <e0b>   DW_AT_type        : <0xd3f>
    <e0f>   DW_AT_data_member_location: 52
 <2><e10>: Abbrev Number: 1 (DW_TAG_member)
    <e11>   DW_AT_name        : (indirect string, offset: 0x8e54): FUNCTION1
    <e15>   DW_AT_decl_file   : 4
    <e15>   DW_AT_decl_line   : 920
    <e17>   DW_AT_decl_column : 18
    <e17>   DW_AT_type        : <0xd3f>
    <e1b>   DW_AT_data_member_location: 56
 <2><e1c>: Abbrev Number: 1 (DW_TAG_member)
    <e1d>   DW_AT_name        : (indirect string, offset: 0x88d3f): RESERVED1
    <e21>   DW_AT_decl_file   : 4
    <e21>   DW_AT_decl_line   : 921
    <e23>   DW_AT_decl_column : 18
    <e23>   DW_AT_type        : <0xd50>
    <e27>   DW_AT_data_member_location: 60
 <2><e28>: Abbrev Number: 1 (DW_TAG_member)
    <e29>   DW_AT_name        : (indirect string, offset: 0x17ee3): COMP2
    <e2d>   DW_AT_decl_file   : 4
    <e2d>   DW_AT_decl_line   : 922
    <e2f>   DW_AT_decl_column : 18
    <e2f>   DW_AT_type        : <0xd3f>
    <e33>   DW_AT_data_member_location: 64
 <2><e34>: Abbrev Number: 1 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0x5ce5c): MASK2
    <e39>   DW_AT_decl_file   : 4
    <e39>   DW_AT_decl_line   : 923
    <e3b>   DW_AT_decl_column : 18
    <e3b>   DW_AT_type        : <0xd3f>
    <e3f>   DW_AT_data_member_location: 68
 <2><e40>: Abbrev Number: 1 (DW_TAG_member)
    <e41>   DW_AT_name        : (indirect string, offset: 0x8e5e): FUNCTION2
    <e45>   DW_AT_decl_file   : 4
    <e45>   DW_AT_decl_line   : 924
    <e47>   DW_AT_decl_column : 18
    <e47>   DW_AT_type        : <0xd3f>
    <e4b>   DW_AT_data_member_location: 72
 <2><e4c>: Abbrev Number: 1 (DW_TAG_member)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x88d49): RESERVED2
    <e51>   DW_AT_decl_file   : 4
    <e51>   DW_AT_decl_line   : 925
    <e53>   DW_AT_decl_column : 18
    <e53>   DW_AT_type        : <0xd50>
    <e57>   DW_AT_data_member_location: 76
 <2><e58>: Abbrev Number: 1 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0x6507d): COMP3
    <e5d>   DW_AT_decl_file   : 4
    <e5d>   DW_AT_decl_line   : 926
    <e5f>   DW_AT_decl_column : 18
    <e5f>   DW_AT_type        : <0xd3f>
    <e63>   DW_AT_data_member_location: 80
 <2><e64>: Abbrev Number: 1 (DW_TAG_member)
    <e65>   DW_AT_name        : (indirect string, offset: 0x4b9d0): MASK3
    <e69>   DW_AT_decl_file   : 4
    <e69>   DW_AT_decl_line   : 927
    <e6b>   DW_AT_decl_column : 18
    <e6b>   DW_AT_type        : <0xd3f>
    <e6f>   DW_AT_data_member_location: 84
 <2><e70>: Abbrev Number: 1 (DW_TAG_member)
    <e71>   DW_AT_name        : (indirect string, offset: 0x8e68): FUNCTION3
    <e75>   DW_AT_decl_file   : 4
    <e75>   DW_AT_decl_line   : 928
    <e77>   DW_AT_decl_column : 18
    <e77>   DW_AT_type        : <0xd3f>
    <e7b>   DW_AT_data_member_location: 88
 <2><e7c>: Abbrev Number: 0
 <1><e7d>: Abbrev Number: 5 (DW_TAG_typedef)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x2b88e): DWT_Type
    <e82>   DW_AT_decl_file   : 4
    <e82>   DW_AT_decl_line   : 929
    <e84>   DW_AT_decl_column : 3
    <e84>   DW_AT_type        : <0xd60>
 <1><e88>: Abbrev Number: 4 (DW_TAG_structure_type)
    <e89>   DW_AT_byte_size   : 16
    <e8a>   DW_AT_decl_file   : 4
    <e8a>   DW_AT_decl_line   : 1421
    <e8c>   DW_AT_decl_column : 9
    <e8c>   DW_AT_sibling     : <0xec1>
 <2><e90>: Abbrev Number: 1 (DW_TAG_member)
    <e91>   DW_AT_name        : (indirect string, offset: 0x6b1de): DHCSR
    <e95>   DW_AT_decl_file   : 4
    <e95>   DW_AT_decl_line   : 1423
    <e97>   DW_AT_decl_column : 18
    <e97>   DW_AT_type        : <0xd3f>
    <e9b>   DW_AT_data_member_location: 0
 <2><e9c>: Abbrev Number: 1 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x7e225): DCRSR
    <ea1>   DW_AT_decl_file   : 4
    <ea1>   DW_AT_decl_line   : 1424
    <ea3>   DW_AT_decl_column : 18
    <ea3>   DW_AT_type        : <0xd3f>
    <ea7>   DW_AT_data_member_location: 4
 <2><ea8>: Abbrev Number: 1 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x79e25): DCRDR
    <ead>   DW_AT_decl_file   : 4
    <ead>   DW_AT_decl_line   : 1425
    <eaf>   DW_AT_decl_column : 18
    <eaf>   DW_AT_type        : <0xd3f>
    <eb3>   DW_AT_data_member_location: 8
 <2><eb4>: Abbrev Number: 1 (DW_TAG_member)
    <eb5>   DW_AT_name        : (indirect string, offset: 0x4dc8a): DEMCR
    <eb9>   DW_AT_decl_file   : 4
    <eb9>   DW_AT_decl_line   : 1426
    <ebb>   DW_AT_decl_column : 18
    <ebb>   DW_AT_type        : <0xd3f>
    <ebf>   DW_AT_data_member_location: 12
 <2><ec0>: Abbrev Number: 0
 <1><ec1>: Abbrev Number: 5 (DW_TAG_typedef)
    <ec2>   DW_AT_name        : (indirect string, offset: 0x41226): CoreDebug_Type
    <ec6>   DW_AT_decl_file   : 4
    <ec6>   DW_AT_decl_line   : 1427
    <ec8>   DW_AT_decl_column : 3
    <ec8>   DW_AT_type        : <0xe88>
 <1><ecc>: Abbrev Number: 12 (DW_TAG_subprogram)
    <ecd>   DW_AT_external    : 1
    <ecd>   DW_AT_name        : (indirect string, offset: 0x45037): getRunTimeCounterValue
    <ed1>   DW_AT_decl_file   : 1
    <ed2>   DW_AT_decl_line   : 69
    <ed3>   DW_AT_decl_column : 22
    <ed4>   DW_AT_prototyped  : 1
    <ed4>   DW_AT_type        : <0xd25>
    <ed8>   DW_AT_low_pc      : 0x8000cec
    <edc>   DW_AT_high_pc     : 0x18
    <ee0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ee2>   DW_AT_call_all_calls: 1
 <1><ee2>: Abbrev Number: 13 (DW_TAG_subprogram)
    <ee3>   DW_AT_external    : 1
    <ee3>   DW_AT_name        : (indirect string, offset: 0x23be2): configureTimerForRunTimeStats
    <ee7>   DW_AT_decl_file   : 1
    <ee8>   DW_AT_decl_line   : 61
    <ee9>   DW_AT_decl_column : 13
    <eea>   DW_AT_prototyped  : 1
    <eea>   DW_AT_low_pc      : 0x8000cb8
    <eee>   DW_AT_high_pc     : 0x34
    <ef2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ef4>   DW_AT_call_all_calls: 1
 <1><ef4>: Abbrev Number: 0
  Compilation Unit @ offset 0xef5:
   Length:        0x1ef (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x4df
   Pointer Size:  4
 <0><f01>: Abbrev Number: 10 (DW_TAG_compile_unit)
    <f02>   DW_AT_producer    : (indirect string, offset: 0x5103): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -ffast-math -fstack-usage -fcyclomatic-complexity
    <f06>   DW_AT_language    : 29	(C11)
    <f07>   DW_AT_name        : (indirect string, offset: 0x91c01): ../Core/Src/fsm.c
    <f0b>   DW_AT_comp_dir    : (indirect string, offset: 0x3887): C:/Users/worbb/Desktop/Electronics/SEMP/sempspace/p2_vibrationsensor_FreeRTOS/Debug
    <f0f>   DW_AT_ranges      : 0x125
    <f13>   DW_AT_low_pc      : 0
    <f17>   DW_AT_stmt_list   : 0x19e8
    <f1b>   DW_AT_macros      : 0x14bb6
 <1><f1f>: Abbrev Number: 2 (DW_TAG_typedef)
    <f20>   DW_AT_name        : (indirect string, offset: 0xcd3d): size_t
    <f24>   DW_AT_decl_file   : 2
    <f25>   DW_AT_decl_line   : 214
    <f26>   DW_AT_decl_column : 23
    <f27>   DW_AT_type        : <0xf2b>
 <1><f2b>: Abbrev Number: 1 (DW_TAG_base_type)
    <f2c>   DW_AT_byte_size   : 4
    <f2d>   DW_AT_encoding    : 7	(unsigned)
    <f2e>   DW_AT_name        : (indirect string, offset: 0x1474): unsigned int
 <1><f32>: Abbrev Number: 11 (DW_TAG_base_type)
    <f33>   DW_AT_byte_size   : 4
    <f34>   DW_AT_encoding    : 5	(signed)
    <f35>   DW_AT_name        : int
 <1><f39>: Abbrev Number: 1 (DW_TAG_base_type)
    <f3a>   DW_AT_byte_size   : 8
    <f3b>   DW_AT_encoding    : 5	(signed)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x2dc6): long long int
 <1><f40>: Abbrev Number: 1 (DW_TAG_base_type)
    <f41>   DW_AT_byte_size   : 8
    <f42>   DW_AT_encoding    : 4	(float)
    <f43>   DW_AT_name        : (indirect string, offset: 0x77bc3): long double
 <1><f47>: Abbrev Number: 1 (DW_TAG_base_type)
    <f48>   DW_AT_byte_size   : 1
    <f49>   DW_AT_encoding    : 6	(signed char)
    <f4a>   DW_AT_name        : (indirect string, offset: 0x379a): signed char
 <1><f4e>: Abbrev Number: 1 (DW_TAG_base_type)
    <f4f>   DW_AT_byte_size   : 1
    <f50>   DW_AT_encoding    : 8	(unsigned char)
    <f51>   DW_AT_name        : (indirect string, offset: 0x3587): unsigned char
 <1><f55>: Abbrev Number: 1 (DW_TAG_base_type)
    <f56>   DW_AT_byte_size   : 2
    <f57>   DW_AT_encoding    : 5	(signed)
    <f58>   DW_AT_name        : (indirect string, offset: 0x54e): short int
 <1><f5c>: Abbrev Number: 1 (DW_TAG_base_type)
    <f5d>   DW_AT_byte_size   : 2
    <f5e>   DW_AT_encoding    : 7	(unsigned)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x4018): short unsigned int
 <1><f63>: Abbrev Number: 1 (DW_TAG_base_type)
    <f64>   DW_AT_byte_size   : 4
    <f65>   DW_AT_encoding    : 5	(signed)
    <f66>   DW_AT_name        : (indirect string, offset: 0x4255): long int
 <1><f6a>: Abbrev Number: 1 (DW_TAG_base_type)
    <f6b>   DW_AT_byte_size   : 4
    <f6c>   DW_AT_encoding    : 7	(unsigned)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x104e): long unsigned int
 <1><f71>: Abbrev Number: 1 (DW_TAG_base_type)
    <f72>   DW_AT_byte_size   : 8
    <f73>   DW_AT_encoding    : 7	(unsigned)
    <f74>   DW_AT_name        : (indirect string, offset: 0x4835): long long unsigned int
 <1><f78>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <f79>   DW_AT_byte_size   : 4
 <1><f7a>: Abbrev Number: 1 (DW_TAG_base_type)
    <f7b>   DW_AT_byte_size   : 1
    <f7c>   DW_AT_encoding    : 8	(unsigned char)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x332a2): char
 <1><f81>: Abbrev Number: 2 (DW_TAG_typedef)
    <f82>   DW_AT_name        : (indirect string, offset: 0x92596): fsm_t
    <f86>   DW_AT_decl_file   : 3
    <f87>   DW_AT_decl_line   : 7
    <f88>   DW_AT_decl_column : 22
    <f89>   DW_AT_type        : <0xf8d>
 <1><f8d>: Abbrev Number: 7 (DW_TAG_structure_type)
    <f8e>   DW_AT_name        : (indirect string, offset: 0x92596): fsm_t
    <f92>   DW_AT_byte_size   : 8
    <f93>   DW_AT_decl_file   : 3
    <f93>   DW_AT_decl_line   : 33
    <f94>   DW_AT_decl_column : 8
    <f95>   DW_AT_sibling     : <0xfb0>
 <2><f99>: Abbrev Number: 4 (DW_TAG_member)
    <f9a>   DW_AT_name        : (indirect string, offset: 0x92363): current_state
    <f9e>   DW_AT_decl_file   : 3
    <f9e>   DW_AT_decl_line   : 35
    <f9f>   DW_AT_decl_column : 7
    <f9f>   DW_AT_type        : <0xf32>
    <fa3>   DW_AT_data_member_location: 0
 <2><fa4>: Abbrev Number: 5 (DW_TAG_member)
    <fa5>   DW_AT_name        : tt
    <fa8>   DW_AT_decl_file   : 3
